espressif/esp-idf/components/esp32/include/soc/uart_register.h
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_UART_REG_H_
#define _SOC_UART_REG_H_

#include "soc.h"

//Slow bus
//#define REG_UART_BASE( i )  (0x60000000+(i)*0x10000)
//Fast bus
#define REG_UART_BASE( i )  (0x3ff40000+(i)*0x10000)

#define UART_FIFO_REG(i)          (REG_UART_BASE(i) + 0x0)
    /* UART_RXFIFO_RD_BYTE : RO ;bitpos:[7:0] ;default: 8'b0 ; */
    /*description: R/W share the same address*/
    #define UART_RXFIFO_RD_BYTE  0x000000FF
    #define UART_RXFIFO_RD_BYTE_M  ((UART_RXFIFO_RD_BYTE_V)<<(UART_RXFIFO_RD_BYTE_S))
    #define UART_RXFIFO_RD_BYTE_V  0xFF
    #define UART_RXFIFO_RD_BYTE_S  0
        #define UART_GET_RXFIFO_RD_BYTE(i)  GET_PERI_REG_BITS2(UART_FIFO_REG(i) , UART_RXFIFO_RD_BYTE_V, UART_RXFIFO_RD_BYTE_S)
		#define UART_SET_TXFIFO_WR_BYTE(i,val)  SET_PERI_REG_BITS(UART_FIFO_REG(i) , UART_RXFIFO_RD_BYTE_V, val, UART_RXFIFO_RD_BYTE_S)



#define UART_INT_RAW_REG(i)          (REG_UART_BASE(i) + 0x4)
    /* UART_AT_CMD_CHAR_DET_INT_RAW : RO ;bitpos:[18] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for detecting AT_CMD char interrupt*/
    #define UART_AT_CMD_CHAR_DET_INT_RAW  (BIT(18))
    #define UART_AT_CMD_CHAR_DET_INT_RAW_M  (BIT(18))
    #define UART_AT_CMD_CHAR_DET_INT_RAW_V  0x1
    #define UART_AT_CMD_CHAR_DET_INT_RAW_S  18
    /* UART_RS485_CLASH_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for rs485 tx rx clash interrrupt*/
    #define UART_RS485_CLASH_INT_RAW  (BIT(17))
    #define UART_RS485_CLASH_INT_RAW_M  (BIT(17))
    #define UART_RS485_CLASH_INT_RAW_V  0x1
    #define UART_RS485_CLASH_INT_RAW_S  17
    /* UART_RS485_FRM_ERR_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for rs485 other rx error*/
    #define UART_RS485_FRM_ERR_INT_RAW  (BIT(16))
    #define UART_RS485_FRM_ERR_INT_RAW_M  (BIT(16))
    #define UART_RS485_FRM_ERR_INT_RAW_V  0x1
    #define UART_RS485_FRM_ERR_INT_RAW_S  16
    /* UART_RS485_PARITY_ERR_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for rs485 parity error*/
    #define UART_RS485_PARITY_ERR_INT_RAW  (BIT(15))
    #define UART_RS485_PARITY_ERR_INT_RAW_M  (BIT(15))
    #define UART_RS485_PARITY_ERR_INT_RAW_V  0x1
    #define UART_RS485_PARITY_ERR_INT_RAW_S  15
    /* UART_TX_DONE_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for tx done*/
    #define UART_TX_DONE_INT_RAW  (BIT(14))
    #define UART_TX_DONE_INT_RAW_M  (BIT(14))
    #define UART_TX_DONE_INT_RAW_V  0x1
    #define UART_TX_DONE_INT_RAW_S  14
    /* UART_TX_BRK_IDLE_DONE_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for tx send idle done(depends on the uart_tx_idle_num)*/
    #define UART_TX_BRK_IDLE_DONE_INT_RAW  (BIT(13))
    #define UART_TX_BRK_IDLE_DONE_INT_RAW_M  (BIT(13))
    #define UART_TX_BRK_IDLE_DONE_INT_RAW_V  0x1
    #define UART_TX_BRK_IDLE_DONE_INT_RAW_S  13
    /* UART_TX_BRK_DONE_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for send 0 done(depends on uart_tx_brk_num)*/
    #define UART_TX_BRK_DONE_INT_RAW  (BIT(12))
    #define UART_TX_BRK_DONE_INT_RAW_M  (BIT(12))
    #define UART_TX_BRK_DONE_INT_RAW_V  0x1
    #define UART_TX_BRK_DONE_INT_RAW_S  12
    /* UART_GLITCH_DET_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for detecting rx glitch pulse*/
    #define UART_GLITCH_DET_INT_RAW  (BIT(11))
    #define UART_GLITCH_DET_INT_RAW_M  (BIT(11))
    #define UART_GLITCH_DET_INT_RAW_V  0x1
    #define UART_GLITCH_DET_INT_RAW_S  11
    /* UART_SW_XOFF_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for rx receive xoff char(depends on the uart_xoff_char )*/
    #define UART_SW_XOFF_INT_RAW  (BIT(10))
    #define UART_SW_XOFF_INT_RAW_M  (BIT(10))
    #define UART_SW_XOFF_INT_RAW_V  0x1
    #define UART_SW_XOFF_INT_RAW_S  10
    /* UART_SW_XON_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for rx receive xon char(depends on the uart_xon_char )*/
    #define UART_SW_XON_INT_RAW  (BIT(9))
    #define UART_SW_XON_INT_RAW_M  (BIT(9))
    #define UART_SW_XON_INT_RAW_V  0x1
    #define UART_SW_XON_INT_RAW_S  9
    /* UART_RXFIFO_TOUT_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for Rx time-out interrupt(depands on the UART_RX_TOUT_THRHD)*/
    #define UART_RXFIFO_TOUT_INT_RAW  (BIT(8))
    #define UART_RXFIFO_TOUT_INT_RAW_M  (BIT(8))
    #define UART_RXFIFO_TOUT_INT_RAW_V  0x1
    #define UART_RXFIFO_TOUT_INT_RAW_S  8
    /* UART_BRK_DET_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for Rx byte start error*/
    #define UART_BRK_DET_INT_RAW  (BIT(7))
    #define UART_BRK_DET_INT_RAW_M  (BIT(7))
    #define UART_BRK_DET_INT_RAW_V  0x1
    #define UART_BRK_DET_INT_RAW_S  7
    /* UART_CTS_CHG_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for CTS changing level*/
    #define UART_CTS_CHG_INT_RAW  (BIT(6))
    #define UART_CTS_CHG_INT_RAW_M  (BIT(6))
    #define UART_CTS_CHG_INT_RAW_V  0x1
    #define UART_CTS_CHG_INT_RAW_S  6
    /* UART_DSR_CHG_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for DSR changing level*/
    #define UART_DSR_CHG_INT_RAW  (BIT(5))
    #define UART_DSR_CHG_INT_RAW_M  (BIT(5))
    #define UART_DSR_CHG_INT_RAW_V  0x1
    #define UART_DSR_CHG_INT_RAW_S  5
    /* UART_RXFIFO_OVF_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for rx fifo overflow*/
    #define UART_RXFIFO_OVF_INT_RAW  (BIT(4))
    #define UART_RXFIFO_OVF_INT_RAW_M  (BIT(4))
    #define UART_RXFIFO_OVF_INT_RAW_V  0x1
    #define UART_RXFIFO_OVF_INT_RAW_S  4
    /* UART_FRM_ERR_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for other rx error*/
    #define UART_FRM_ERR_INT_RAW  (BIT(3))
    #define UART_FRM_ERR_INT_RAW_M  (BIT(3))
    #define UART_FRM_ERR_INT_RAW_V  0x1
    #define UART_FRM_ERR_INT_RAW_S  3
    /* UART_PARITY_ERR_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for parity check error*/
    #define UART_PARITY_ERR_INT_RAW  (BIT(2))
    #define UART_PARITY_ERR_INT_RAW_M  (BIT(2))
    #define UART_PARITY_ERR_INT_RAW_V  0x1
    #define UART_PARITY_ERR_INT_RAW_S  2
    /* UART_TXFIFO_EMPTY_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for tx fifo empty interrupt(depands on UART_TXFIFO_EMPTY_THRHD bits)*/
    #define UART_TXFIFO_EMPTY_INT_RAW  (BIT(1))
    #define UART_TXFIFO_EMPTY_INT_RAW_M  (BIT(1))
    #define UART_TXFIFO_EMPTY_INT_RAW_V  0x1
    #define UART_TXFIFO_EMPTY_INT_RAW_S  1
    /* UART_RXFIFO_FULL_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
    /*description: The interrupt raw bit for rx fifo full interrupt(depands on UART_RXFIFO_FULL_THRHD bits)*/
    #define UART_RXFIFO_FULL_INT_RAW  (BIT(0))
    #define UART_RXFIFO_FULL_INT_RAW_M  (BIT(0))
    #define UART_RXFIFO_FULL_INT_RAW_V  0x1
    #define UART_RXFIFO_FULL_INT_RAW_S  0
        #define UART_GET_AT_CMD_CHAR_DET_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_AT_CMD_CHAR_DET_INT_RAW_V, UART_AT_CMD_CHAR_DET_INT_RAW_S)
        #define UART_GET_RS485_CLASH_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_RS485_CLASH_INT_RAW_V, UART_RS485_CLASH_INT_RAW_S)
        #define UART_GET_RS485_FRM_ERR_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_RS485_FRM_ERR_INT_RAW_V, UART_RS485_FRM_ERR_INT_RAW_S)
        #define UART_GET_RS485_PARITY_ERR_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_RS485_PARITY_ERR_INT_RAW_V, UART_RS485_PARITY_ERR_INT_RAW_S)
        #define UART_GET_TX_DONE_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_TX_DONE_INT_RAW_V, UART_TX_DONE_INT_RAW_S)
        #define UART_GET_TX_BRK_IDLE_DONE_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_TX_BRK_IDLE_DONE_INT_RAW_V, UART_TX_BRK_IDLE_DONE_INT_RAW_S)
        #define UART_GET_TX_BRK_DONE_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_TX_BRK_DONE_INT_RAW_V, UART_TX_BRK_DONE_INT_RAW_S)
        #define UART_GET_GLITCH_DET_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_GLITCH_DET_INT_RAW_V, UART_GLITCH_DET_INT_RAW_S)
        #define UART_GET_SW_XOFF_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_SW_XOFF_INT_RAW_V, UART_SW_XOFF_INT_RAW_S)
        #define UART_GET_SW_XON_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_SW_XON_INT_RAW_V, UART_SW_XON_INT_RAW_S)
        #define UART_GET_RXFIFO_TOUT_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_RXFIFO_TOUT_INT_RAW_V, UART_RXFIFO_TOUT_INT_RAW_S)
        #define UART_GET_BRK_DET_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_BRK_DET_INT_RAW_V, UART_BRK_DET_INT_RAW_S)
        #define UART_GET_CTS_CHG_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_CTS_CHG_INT_RAW_V, UART_CTS_CHG_INT_RAW_S)
        #define UART_GET_DSR_CHG_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_DSR_CHG_INT_RAW_V, UART_DSR_CHG_INT_RAW_S)
        #define UART_GET_RXFIFO_OVF_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_RXFIFO_OVF_INT_RAW_V, UART_RXFIFO_OVF_INT_RAW_S)
        #define UART_GET_FRM_ERR_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_FRM_ERR_INT_RAW_V, UART_FRM_ERR_INT_RAW_S)
        #define UART_GET_PARITY_ERR_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_PARITY_ERR_INT_RAW_V, UART_PARITY_ERR_INT_RAW_S)
        #define UART_GET_TXFIFO_EMPTY_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_TXFIFO_EMPTY_INT_RAW_V, UART_TXFIFO_EMPTY_INT_RAW_S)
        #define UART_GET_RXFIFO_FULL_INT_RAW(i)  GET_PERI_REG_BITS2(UART_INT_RAW_REG(i) , UART_RXFIFO_FULL_INT_RAW_V, UART_RXFIFO_FULL_INT_RAW_S)



#define UART_INT_ST_REG(i)          (REG_UART_BASE(i) + 0x8)
    /* UART_AT_CMD_CHAR_DET_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */
    /*description: The interrupt state bit for detecting AT_CMD char interrupt*/
    #define UART_AT_CMD_CHAR_DET_INT_ST  (BIT(18))
    #define UART_AT_CMD_CHAR_DET_INT_ST_M  (BIT(18))
    #define UART_AT_CMD_CHAR_DET_INT_ST_V  0x1
    #define UART_AT_CMD_CHAR_DET_INT_ST_S  18
    /* UART_RS485_CLASH_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
    /*description: The interrupt state bit for rs485 tx rx clash interrrupt*/
    #define UART_RS485_CLASH_INT_ST  (BIT(17))
    #define UART_RS485_CLASH_INT_ST_M  (BIT(17))
    #define UART_RS485_CLASH_INT_ST_V  0x1
    #define UART_RS485_CLASH_INT_ST_S  17
    /* UART_RS485_FRM_ERR_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
    /*description: The interrupt state bit for rs485 other rx error*/
    #define UART_RS485_FRM_ERR_INT_ST  (BIT(16))
    #define UART_RS485_FRM_ERR_INT_ST_M  (BIT(16))
    #define UART_RS485_FRM_ERR_INT_ST_V  0x1
    #define UART_RS485_FRM_ERR_INT_ST_S  16
    /* UART_RS485_PARITY_ERR_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
    /*description: The interrupt state bit for rs485 parity error*/
    #define UART_RS485_PARITY_ERR_INT_ST  (BIT(15))
    #define UART_RS485_PARITY_ERR_INT_ST_M  (BIT(15))
    #define UART_RS485_PARITY_ERR_INT_ST_V  0x1
    #define UART_RS485_PARITY_ERR_INT_ST_S  15
    /* UART_TX_DONE_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
    /*description: The interrupt state bit for tx done event*/
    #define UART_TX_DONE_INT_ST  (BIT(14))
    #define UART_TX_DONE_INT_ST_M  (BIT(14))
    #define UART_TX_DONE_INT_ST_V  0x1
    #define UART_TX_DONE_INT_ST_S  14
    /* UART_TX_BRK_IDLE_DONE_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
    /*description: The interrupt state bit for tx send idle done event*/
    #define UART_TX_BRK_IDLE_DONE_INT_ST  (BIT(13))
    #define UART_TX_BRK_IDLE_DONE_INT_ST_M  (BIT(13))
    #define UART_TX_BRK_IDLE_DONE_INT_ST_V  0x1
    #define UART_TX_BRK_IDLE_DONE_INT_ST_S  13
    /* UART_TX_BRK_DONE_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
    /*description: The interrupt state bit for send 0 done event*/
    #define UART_TX_BRK_DONE_INT_ST  (BIT(12))
    #define UART_TX_BRK_DONE_INT_ST_M  (BIT(12))
    #define UART_TX_BRK_DONE_INT_ST_V  0x1
    #define UART_TX_BRK_DONE_INT_ST_S  12
    /* UART_GLITCH_DET_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
    /*description: The interrupt state bit for detecting rx glitch pulse event*/
    #define UART_GLITCH_DET_INT_ST  (BIT(11))
    #define UART_GLITCH_DET_INT_ST_M  (BIT(11))
    #define UART_GLITCH_DET_INT_ST_V  0x1
    #define UART_GLITCH_DET_INT_ST_S  11
    /* UART_SW_XOFF_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
    /*description: The interrupt state bit for rx receive xoff char event*/
    #define UART_SW_XOFF_INT_ST  (BIT(10))
    #define UART_SW_XOFF_INT_ST_M  (BIT(10))
    #define UART_SW_XOFF_INT_ST_V  0x1
    #define UART_SW_XOFF_INT_ST_S  10
    /* UART_SW_XON_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
    /*description: The interrupt state bit for rx receive xon char event*/
    #define UART_SW_XON_INT_ST  (BIT(9))
    #define UART_SW_XON_INT_ST_M  (BIT(9))
    #define UART_SW_XON_INT_ST_V  0x1
    #define UART_SW_XON_INT_ST_S  9
    /* UART_RXFIFO_TOUT_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
    /*description: The interrupt state bit for Rx time-out event*/
    #define UART_RXFIFO_TOUT_INT_ST  (BIT(8))
    #define UART_RXFIFO_TOUT_INT_ST_M  (BIT(8))
    #define UART_RXFIFO_TOUT_INT_ST_V  0x1
    #define UART_RXFIFO_TOUT_INT_ST_S  8
    /* UART_BRK_DET_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
    /*description: The interrupt state bit for rx byte start error*/
    #define UART_BRK_DET_INT_ST  (BIT(7))
    #define UART_BRK_DET_INT_ST_M  (BIT(7))
    #define UART_BRK_DET_INT_ST_V  0x1
    #define UART_BRK_DET_INT_ST_S  7
    /* UART_CTS_CHG_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
    /*description: The interrupt state bit for CTS changing level*/
    #define UART_CTS_CHG_INT_ST  (BIT(6))
    #define UART_CTS_CHG_INT_ST_M  (BIT(6))
    #define UART_CTS_CHG_INT_ST_V  0x1
    #define UART_CTS_CHG_INT_ST_S  6
    /* UART_DSR_CHG_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
    /*description: The interrupt state bit for DSR changing level*/
    #define UART_DSR_CHG_INT_ST  (BIT(5))
    #define UART_DSR_CHG_INT_ST_M  (BIT(5))
    #define UART_DSR_CHG_INT_ST_V  0x1
    #define UART_DSR_CHG_INT_ST_S  5
    /* UART_RXFIFO_OVF_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
    /*description: The interrupt state bit for RX fifo overflow*/
    #define UART_RXFIFO_OVF_INT_ST  (BIT(4))
    #define UART_RXFIFO_OVF_INT_ST_M  (BIT(4))
    #define UART_RXFIFO_OVF_INT_ST_V  0x1
    #define UART_RXFIFO_OVF_INT_ST_S  4
    /* UART_FRM_ERR_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
    /*description: The interrupt state for other rx error*/
    #define UART_FRM_ERR_INT_ST  (BIT(3))
    #define UART_FRM_ERR_INT_ST_M  (BIT(3))
    #define UART_FRM_ERR_INT_ST_V  0x1
    #define UART_FRM_ERR_INT_ST_S  3
    /* UART_PARITY_ERR_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
    /*description: The interrupt state bit for rx parity error*/
    #define UART_PARITY_ERR_INT_ST  (BIT(2))
    #define UART_PARITY_ERR_INT_ST_M  (BIT(2))
    #define UART_PARITY_ERR_INT_ST_V  0x1
    #define UART_PARITY_ERR_INT_ST_S  2
    /* UART_TXFIFO_EMPTY_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
    /*description: The interrupt state bit for TX fifo empty*/
    #define UART_TXFIFO_EMPTY_INT_ST  (BIT(1))
    #define UART_TXFIFO_EMPTY_INT_ST_M  (BIT(1))
    #define UART_TXFIFO_EMPTY_INT_ST_V  0x1
    #define UART_TXFIFO_EMPTY_INT_ST_S  1
    /* UART_RXFIFO_FULL_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
    /*description: The interrupt state bit for RX fifo full event*/
    #define UART_RXFIFO_FULL_INT_ST  (BIT(0))
    #define UART_RXFIFO_FULL_INT_ST_M  (BIT(0))
    #define UART_RXFIFO_FULL_INT_ST_V  0x1
    #define UART_RXFIFO_FULL_INT_ST_S  0
        #define UART_GET_AT_CMD_CHAR_DET_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_AT_CMD_CHAR_DET_INT_ST_V, UART_AT_CMD_CHAR_DET_INT_ST_S)
        #define UART_GET_RS485_CLASH_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_RS485_CLASH_INT_ST_V, UART_RS485_CLASH_INT_ST_S)
        #define UART_GET_RS485_FRM_ERR_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_RS485_FRM_ERR_INT_ST_V, UART_RS485_FRM_ERR_INT_ST_S)
        #define UART_GET_RS485_PARITY_ERR_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_RS485_PARITY_ERR_INT_ST_V, UART_RS485_PARITY_ERR_INT_ST_S)
        #define UART_GET_TX_DONE_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_TX_DONE_INT_ST_V, UART_TX_DONE_INT_ST_S)
        #define UART_GET_TX_BRK_IDLE_DONE_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_TX_BRK_IDLE_DONE_INT_ST_V, UART_TX_BRK_IDLE_DONE_INT_ST_S)
        #define UART_GET_TX_BRK_DONE_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_TX_BRK_DONE_INT_ST_V, UART_TX_BRK_DONE_INT_ST_S)
        #define UART_GET_GLITCH_DET_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_GLITCH_DET_INT_ST_V, UART_GLITCH_DET_INT_ST_S)
        #define UART_GET_SW_XOFF_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_SW_XOFF_INT_ST_V, UART_SW_XOFF_INT_ST_S)
        #define UART_GET_SW_XON_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_SW_XON_INT_ST_V, UART_SW_XON_INT_ST_S)
        #define UART_GET_RXFIFO_TOUT_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_RXFIFO_TOUT_INT_ST_V, UART_RXFIFO_TOUT_INT_ST_S)
        #define UART_GET_BRK_DET_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_BRK_DET_INT_ST_V, UART_BRK_DET_INT_ST_S)
        #define UART_GET_CTS_CHG_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_CTS_CHG_INT_ST_V, UART_CTS_CHG_INT_ST_S)
        #define UART_GET_DSR_CHG_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_DSR_CHG_INT_ST_V, UART_DSR_CHG_INT_ST_S)
        #define UART_GET_RXFIFO_OVF_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_RXFIFO_OVF_INT_ST_V, UART_RXFIFO_OVF_INT_ST_S)
        #define UART_GET_FRM_ERR_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_FRM_ERR_INT_ST_V, UART_FRM_ERR_INT_ST_S)
        #define UART_GET_PARITY_ERR_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_PARITY_ERR_INT_ST_V, UART_PARITY_ERR_INT_ST_S)
        #define UART_GET_TXFIFO_EMPTY_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_TXFIFO_EMPTY_INT_ST_V, UART_TXFIFO_EMPTY_INT_ST_S)
        #define UART_GET_RXFIFO_FULL_INT_ST(i)  GET_PERI_REG_BITS2(UART_INT_ST_REG(i) , UART_RXFIFO_FULL_INT_ST_V, UART_RXFIFO_FULL_INT_ST_S)



