espressif/esp-idf/components/esp32/include/soc/uart_register.h
#define UART_INT_ENA_REG(i)          (REG_UART_BASE(i) + 0xC)
    /* UART_AT_CMD_CHAR_DET_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for detecting AT_CMD char interrupt*/
    #define UART_AT_CMD_CHAR_DET_INT_ENA  (BIT(18))
    #define UART_AT_CMD_CHAR_DET_INT_ENA_M  (BIT(18))
    #define UART_AT_CMD_CHAR_DET_INT_ENA_V  0x1
    #define UART_AT_CMD_CHAR_DET_INT_ENA_S  18
    /* UART_RS485_CLASH_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for rs485 tx rx clash interrrupt*/
    #define UART_RS485_CLASH_INT_ENA  (BIT(17))
    #define UART_RS485_CLASH_INT_ENA_M  (BIT(17))
    #define UART_RS485_CLASH_INT_ENA_V  0x1
    #define UART_RS485_CLASH_INT_ENA_S  17
    /* UART_RS485_FRM_ERR_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for rs485 other rx error*/
    #define UART_RS485_FRM_ERR_INT_ENA  (BIT(16))
    #define UART_RS485_FRM_ERR_INT_ENA_M  (BIT(16))
    #define UART_RS485_FRM_ERR_INT_ENA_V  0x1
    #define UART_RS485_FRM_ERR_INT_ENA_S  16
    /* UART_RS485_PARITY_ERR_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for rs485 parity error*/
    #define UART_RS485_PARITY_ERR_INT_ENA  (BIT(15))
    #define UART_RS485_PARITY_ERR_INT_ENA_M  (BIT(15))
    #define UART_RS485_PARITY_ERR_INT_ENA_V  0x1
    #define UART_RS485_PARITY_ERR_INT_ENA_S  15
    /* UART_TX_DONE_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for tx done interrupt*/
    #define UART_TX_DONE_INT_ENA  (BIT(14))
    #define UART_TX_DONE_INT_ENA_M  (BIT(14))
    #define UART_TX_DONE_INT_ENA_V  0x1
    #define UART_TX_DONE_INT_ENA_S  14
    /* UART_TX_BRK_IDLE_DONE_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for tx send idle done interrupt*/
    #define UART_TX_BRK_IDLE_DONE_INT_ENA  (BIT(13))
    #define UART_TX_BRK_IDLE_DONE_INT_ENA_M  (BIT(13))
    #define UART_TX_BRK_IDLE_DONE_INT_ENA_V  0x1
    #define UART_TX_BRK_IDLE_DONE_INT_ENA_S  13
    /* UART_TX_BRK_DONE_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for send 0 done interrupt*/
    #define UART_TX_BRK_DONE_INT_ENA  (BIT(12))
    #define UART_TX_BRK_DONE_INT_ENA_M  (BIT(12))
    #define UART_TX_BRK_DONE_INT_ENA_V  0x1
    #define UART_TX_BRK_DONE_INT_ENA_S  12
    /* UART_GLITCH_DET_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for detecting rx glitch pulse interrupt*/
    #define UART_GLITCH_DET_INT_ENA  (BIT(11))
    #define UART_GLITCH_DET_INT_ENA_M  (BIT(11))
    #define UART_GLITCH_DET_INT_ENA_V  0x1
    #define UART_GLITCH_DET_INT_ENA_S  11
    /* UART_SW_XOFF_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for rx receive xoff char interrupt*/
    #define UART_SW_XOFF_INT_ENA  (BIT(10))
    #define UART_SW_XOFF_INT_ENA_M  (BIT(10))
    #define UART_SW_XOFF_INT_ENA_V  0x1
    #define UART_SW_XOFF_INT_ENA_S  10
    /* UART_SW_XON_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for rx receive xon char interrupt*/
    #define UART_SW_XON_INT_ENA  (BIT(9))
    #define UART_SW_XON_INT_ENA_M  (BIT(9))
    #define UART_SW_XON_INT_ENA_V  0x1
    #define UART_SW_XON_INT_ENA_S  9
    /* UART_RXFIFO_TOUT_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for rx time-out interrupt*/
    #define UART_RXFIFO_TOUT_INT_ENA  (BIT(8))
    #define UART_RXFIFO_TOUT_INT_ENA_M  (BIT(8))
    #define UART_RXFIFO_TOUT_INT_ENA_V  0x1
    #define UART_RXFIFO_TOUT_INT_ENA_S  8
    /* UART_BRK_DET_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for rx byte start error*/
    #define UART_BRK_DET_INT_ENA  (BIT(7))
    #define UART_BRK_DET_INT_ENA_M  (BIT(7))
    #define UART_BRK_DET_INT_ENA_V  0x1
    #define UART_BRK_DET_INT_ENA_S  7
    /* UART_CTS_CHG_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for CTS changing level*/
    #define UART_CTS_CHG_INT_ENA  (BIT(6))
    #define UART_CTS_CHG_INT_ENA_M  (BIT(6))
    #define UART_CTS_CHG_INT_ENA_V  0x1
    #define UART_CTS_CHG_INT_ENA_S  6
    /* UART_DSR_CHG_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for DSR changing level*/
    #define UART_DSR_CHG_INT_ENA  (BIT(5))
    #define UART_DSR_CHG_INT_ENA_M  (BIT(5))
    #define UART_DSR_CHG_INT_ENA_V  0x1
    #define UART_DSR_CHG_INT_ENA_S  5
    /* UART_RXFIFO_OVF_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for rx fifo overflow*/
    #define UART_RXFIFO_OVF_INT_ENA  (BIT(4))
    #define UART_RXFIFO_OVF_INT_ENA_M  (BIT(4))
    #define UART_RXFIFO_OVF_INT_ENA_V  0x1
    #define UART_RXFIFO_OVF_INT_ENA_S  4
    /* UART_FRM_ERR_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for other rx error*/
    #define UART_FRM_ERR_INT_ENA  (BIT(3))
    #define UART_FRM_ERR_INT_ENA_M  (BIT(3))
    #define UART_FRM_ERR_INT_ENA_V  0x1
    #define UART_FRM_ERR_INT_ENA_S  3
    /* UART_PARITY_ERR_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for parity error*/
    #define UART_PARITY_ERR_INT_ENA  (BIT(2))
    #define UART_PARITY_ERR_INT_ENA_M  (BIT(2))
    #define UART_PARITY_ERR_INT_ENA_V  0x1
    #define UART_PARITY_ERR_INT_ENA_S  2
    /* UART_TXFIFO_EMPTY_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for tx fifo empty event*/
    #define UART_TXFIFO_EMPTY_INT_ENA  (BIT(1))
    #define UART_TXFIFO_EMPTY_INT_ENA_M  (BIT(1))
    #define UART_TXFIFO_EMPTY_INT_ENA_V  0x1
    #define UART_TXFIFO_EMPTY_INT_ENA_S  1
    /* UART_RXFIFO_FULL_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
    /*description: The interrupt enable bit for rx fifo full event*/
    #define UART_RXFIFO_FULL_INT_ENA  (BIT(0))
    #define UART_RXFIFO_FULL_INT_ENA_M  (BIT(0))
    #define UART_RXFIFO_FULL_INT_ENA_V  0x1
    #define UART_RXFIFO_FULL_INT_ENA_S  0
        #define UART_GET_AT_CMD_CHAR_DET_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_AT_CMD_CHAR_DET_INT_ENA_V, UART_AT_CMD_CHAR_DET_INT_ENA_S)
        #define UART_SET_AT_CMD_CHAR_DET_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_AT_CMD_CHAR_DET_INT_ENA_V,(val),UART_AT_CMD_CHAR_DET_INT_ENA_S)
        #define UART_GET_RS485_CLASH_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_RS485_CLASH_INT_ENA_V, UART_RS485_CLASH_INT_ENA_S)
        #define UART_SET_RS485_CLASH_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_RS485_CLASH_INT_ENA_V,(val),UART_RS485_CLASH_INT_ENA_S)
        #define UART_GET_RS485_FRM_ERR_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_RS485_FRM_ERR_INT_ENA_V, UART_RS485_FRM_ERR_INT_ENA_S)
        #define UART_SET_RS485_FRM_ERR_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_RS485_FRM_ERR_INT_ENA_V,(val),UART_RS485_FRM_ERR_INT_ENA_S)
        #define UART_GET_RS485_PARITY_ERR_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_RS485_PARITY_ERR_INT_ENA_V, UART_RS485_PARITY_ERR_INT_ENA_S)
        #define UART_SET_RS485_PARITY_ERR_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_RS485_PARITY_ERR_INT_ENA_V,(val),UART_RS485_PARITY_ERR_INT_ENA_S)
        #define UART_GET_TX_DONE_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_TX_DONE_INT_ENA_V, UART_TX_DONE_INT_ENA_S)
        #define UART_SET_TX_DONE_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_TX_DONE_INT_ENA_V,(val),UART_TX_DONE_INT_ENA_S)
        #define UART_GET_TX_BRK_IDLE_DONE_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_TX_BRK_IDLE_DONE_INT_ENA_V, UART_TX_BRK_IDLE_DONE_INT_ENA_S)
        #define UART_SET_TX_BRK_IDLE_DONE_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_TX_BRK_IDLE_DONE_INT_ENA_V,(val),UART_TX_BRK_IDLE_DONE_INT_ENA_S)
        #define UART_GET_TX_BRK_DONE_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_TX_BRK_DONE_INT_ENA_V, UART_TX_BRK_DONE_INT_ENA_S)
        #define UART_SET_TX_BRK_DONE_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_TX_BRK_DONE_INT_ENA_V,(val),UART_TX_BRK_DONE_INT_ENA_S)
        #define UART_GET_GLITCH_DET_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_GLITCH_DET_INT_ENA_V, UART_GLITCH_DET_INT_ENA_S)
        #define UART_SET_GLITCH_DET_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_GLITCH_DET_INT_ENA_V,(val),UART_GLITCH_DET_INT_ENA_S)
        #define UART_GET_SW_XOFF_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_SW_XOFF_INT_ENA_V, UART_SW_XOFF_INT_ENA_S)
        #define UART_SET_SW_XOFF_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_SW_XOFF_INT_ENA_V,(val),UART_SW_XOFF_INT_ENA_S)
        #define UART_GET_SW_XON_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_SW_XON_INT_ENA_V, UART_SW_XON_INT_ENA_S)
        #define UART_SET_SW_XON_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_SW_XON_INT_ENA_V,(val),UART_SW_XON_INT_ENA_S)
        #define UART_GET_RXFIFO_TOUT_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_RXFIFO_TOUT_INT_ENA_V, UART_RXFIFO_TOUT_INT_ENA_S)
        #define UART_SET_RXFIFO_TOUT_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_RXFIFO_TOUT_INT_ENA_V,(val),UART_RXFIFO_TOUT_INT_ENA_S)
        #define UART_GET_BRK_DET_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_BRK_DET_INT_ENA_V, UART_BRK_DET_INT_ENA_S)
        #define UART_SET_BRK_DET_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_BRK_DET_INT_ENA_V,(val),UART_BRK_DET_INT_ENA_S)
        #define UART_GET_CTS_CHG_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_CTS_CHG_INT_ENA_V, UART_CTS_CHG_INT_ENA_S)
        #define UART_SET_CTS_CHG_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_CTS_CHG_INT_ENA_V,(val),UART_CTS_CHG_INT_ENA_S)
        #define UART_GET_DSR_CHG_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_DSR_CHG_INT_ENA_V, UART_DSR_CHG_INT_ENA_S)
        #define UART_SET_DSR_CHG_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_DSR_CHG_INT_ENA_V,(val),UART_DSR_CHG_INT_ENA_S)
        #define UART_GET_RXFIFO_OVF_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_RXFIFO_OVF_INT_ENA_V, UART_RXFIFO_OVF_INT_ENA_S)
        #define UART_SET_RXFIFO_OVF_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_RXFIFO_OVF_INT_ENA_V,(val),UART_RXFIFO_OVF_INT_ENA_S)
        #define UART_GET_FRM_ERR_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_FRM_ERR_INT_ENA_V, UART_FRM_ERR_INT_ENA_S)
        #define UART_SET_FRM_ERR_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_FRM_ERR_INT_ENA_V,(val),UART_FRM_ERR_INT_ENA_S)
        #define UART_GET_PARITY_ERR_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_PARITY_ERR_INT_ENA_V, UART_PARITY_ERR_INT_ENA_S)
        #define UART_SET_PARITY_ERR_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_PARITY_ERR_INT_ENA_V,(val),UART_PARITY_ERR_INT_ENA_S)
        #define UART_GET_TXFIFO_EMPTY_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_TXFIFO_EMPTY_INT_ENA_V, UART_TXFIFO_EMPTY_INT_ENA_S)
        #define UART_SET_TXFIFO_EMPTY_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_TXFIFO_EMPTY_INT_ENA_V,(val),UART_TXFIFO_EMPTY_INT_ENA_S)
        #define UART_GET_RXFIFO_FULL_INT_ENA(i)  GET_PERI_REG_BITS2(UART_INT_ENA_REG(i) , UART_RXFIFO_FULL_INT_ENA_V, UART_RXFIFO_FULL_INT_ENA_S)
        #define UART_SET_RXFIFO_FULL_INT_ENA(i,val)  SET_PERI_REG_BITS(UART_INT_ENA_REG(i) ,UART_RXFIFO_FULL_INT_ENA_V,(val),UART_RXFIFO_FULL_INT_ENA_S)



#define UART_INT_CLR_REG(i)          (REG_UART_BASE(i) + 0x10)
    /* UART_AT_CMD_CHAR_DET_INT_CLR : WO ;bitpos:[18] ;default: 1'b0 ; */
    /*description: Set this bit for detecting AT_CMD char interrupt*/
    #define UART_AT_CMD_CHAR_DET_INT_CLR  (BIT(18))
    #define UART_AT_CMD_CHAR_DET_INT_CLR_M  (BIT(18))
    #define UART_AT_CMD_CHAR_DET_INT_CLR_V  0x1
    #define UART_AT_CMD_CHAR_DET_INT_CLR_S  18
    /* UART_RS485_CLASH_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
    /*description: Set this bit for rs485 tx rx clash interrrupt*/
    #define UART_RS485_CLASH_INT_CLR  (BIT(17))
    #define UART_RS485_CLASH_INT_CLR_M  (BIT(17))
    #define UART_RS485_CLASH_INT_CLR_V  0x1
    #define UART_RS485_CLASH_INT_CLR_S  17
    /* UART_RS485_FRM_ERR_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
    /*description: Set this bit for rs485 other rx error*/
    #define UART_RS485_FRM_ERR_INT_CLR  (BIT(16))
    #define UART_RS485_FRM_ERR_INT_CLR_M  (BIT(16))
    #define UART_RS485_FRM_ERR_INT_CLR_V  0x1
    #define UART_RS485_FRM_ERR_INT_CLR_S  16
    /* UART_RS485_PARITY_ERR_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
    /*description: Set this bit for rs485 parity error interrupt*/
    #define UART_RS485_PARITY_ERR_INT_CLR  (BIT(15))
    #define UART_RS485_PARITY_ERR_INT_CLR_M  (BIT(15))
    #define UART_RS485_PARITY_ERR_INT_CLR_V  0x1
    #define UART_RS485_PARITY_ERR_INT_CLR_S  15
    /* UART_TX_DONE_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
    /*description: Set this bit to clear the  tx done interrupt*/
    #define UART_TX_DONE_INT_CLR  (BIT(14))
    #define UART_TX_DONE_INT_CLR_M  (BIT(14))
    #define UART_TX_DONE_INT_CLR_V  0x1
    #define UART_TX_DONE_INT_CLR_S  14
    /* UART_TX_BRK_IDLE_DONE_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
    /*description: Set this bit to clear the  tx send idle done interrupt*/
    #define UART_TX_BRK_IDLE_DONE_INT_CLR  (BIT(13))
    #define UART_TX_BRK_IDLE_DONE_INT_CLR_M  (BIT(13))
    #define UART_TX_BRK_IDLE_DONE_INT_CLR_V  0x1
    #define UART_TX_BRK_IDLE_DONE_INT_CLR_S  13
    /* UART_TX_BRK_DONE_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
    /*description: Set this bit to clear the  send 0 done interrupt*/
    #define UART_TX_BRK_DONE_INT_CLR  (BIT(12))
    #define UART_TX_BRK_DONE_INT_CLR_M  (BIT(12))
    #define UART_TX_BRK_DONE_INT_CLR_V  0x1
    #define UART_TX_BRK_DONE_INT_CLR_S  12
    /* UART_GLITCH_DET_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
    /*description: Set this bit to clear the  detecting rx glitch pulse interrupt*/
    #define UART_GLITCH_DET_INT_CLR  (BIT(11))
    #define UART_GLITCH_DET_INT_CLR_M  (BIT(11))
    #define UART_GLITCH_DET_INT_CLR_V  0x1
    #define UART_GLITCH_DET_INT_CLR_S  11
    /* UART_SW_XOFF_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
    /*description: Set this bit to clear the  rx receive xoff char interrupt*/
    #define UART_SW_XOFF_INT_CLR  (BIT(10))
    #define UART_SW_XOFF_INT_CLR_M  (BIT(10))
    #define UART_SW_XOFF_INT_CLR_V  0x1
    #define UART_SW_XOFF_INT_CLR_S  10
    /* UART_SW_XON_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
    /*description: Set this bit to clear the  rx receive xon char interrupt*/
    #define UART_SW_XON_INT_CLR  (BIT(9))
    #define UART_SW_XON_INT_CLR_M  (BIT(9))
    #define UART_SW_XON_INT_CLR_V  0x1
    #define UART_SW_XON_INT_CLR_S  9
    /* UART_RXFIFO_TOUT_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
    /*description: Set this bit to clear the rx time-out interrupt*/
    #define UART_RXFIFO_TOUT_INT_CLR  (BIT(8))
    #define UART_RXFIFO_TOUT_INT_CLR_M  (BIT(8))
    #define UART_RXFIFO_TOUT_INT_CLR_V  0x1
    #define UART_RXFIFO_TOUT_INT_CLR_S  8
    /* UART_BRK_DET_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
    /*description: Set this bit to clear the rx byte start interrupt*/
    #define UART_BRK_DET_INT_CLR  (BIT(7))
    #define UART_BRK_DET_INT_CLR_M  (BIT(7))
    #define UART_BRK_DET_INT_CLR_V  0x1
    #define UART_BRK_DET_INT_CLR_S  7
    /* UART_CTS_CHG_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
    /*description: Set this bit to clear the CTS changing interrupt*/
    #define UART_CTS_CHG_INT_CLR  (BIT(6))
    #define UART_CTS_CHG_INT_CLR_M  (BIT(6))
    #define UART_CTS_CHG_INT_CLR_V  0x1
    #define UART_CTS_CHG_INT_CLR_S  6
    /* UART_DSR_CHG_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
    /*description: Set this bit to clear the DSR changing interrupt*/
    #define UART_DSR_CHG_INT_CLR  (BIT(5))
    #define UART_DSR_CHG_INT_CLR_M  (BIT(5))
    #define UART_DSR_CHG_INT_CLR_V  0x1
    #define UART_DSR_CHG_INT_CLR_S  5
    /* UART_RXFIFO_OVF_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
    /*description: Set this bit to clear the rx fifo over-flow interrupt*/
    #define UART_RXFIFO_OVF_INT_CLR  (BIT(4))
    #define UART_RXFIFO_OVF_INT_CLR_M  (BIT(4))
    #define UART_RXFIFO_OVF_INT_CLR_V  0x1
    #define UART_RXFIFO_OVF_INT_CLR_S  4
    /* UART_FRM_ERR_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
    /*description: Set this bit to clear other rx error interrupt*/
    #define UART_FRM_ERR_INT_CLR  (BIT(3))
    #define UART_FRM_ERR_INT_CLR_M  (BIT(3))
    #define UART_FRM_ERR_INT_CLR_V  0x1
    #define UART_FRM_ERR_INT_CLR_S  3
    /* UART_PARITY_ERR_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
    /*description: Set this bit to clear the parity error interrupt*/
    #define UART_PARITY_ERR_INT_CLR  (BIT(2))
    #define UART_PARITY_ERR_INT_CLR_M  (BIT(2))
    #define UART_PARITY_ERR_INT_CLR_V  0x1
    #define UART_PARITY_ERR_INT_CLR_S  2
    /* UART_TXFIFO_EMPTY_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
    /*description: Set this bit to clear the tx fifo empty interrupt*/
    #define UART_TXFIFO_EMPTY_INT_CLR  (BIT(1))
    #define UART_TXFIFO_EMPTY_INT_CLR_M  (BIT(1))
    #define UART_TXFIFO_EMPTY_INT_CLR_V  0x1
    #define UART_TXFIFO_EMPTY_INT_CLR_S  1
    /* UART_RXFIFO_FULL_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
    /*description: Set this bit to clear the rx fifo full interrupt*/
    #define UART_RXFIFO_FULL_INT_CLR  (BIT(0))
    #define UART_RXFIFO_FULL_INT_CLR_M  (BIT(0))
    #define UART_RXFIFO_FULL_INT_CLR_V  0x1
    #define UART_RXFIFO_FULL_INT_CLR_S  0
        #define UART_SET_AT_CMD_CHAR_DET_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_AT_CMD_CHAR_DET_INT_CLR_V,(val),UART_AT_CMD_CHAR_DET_INT_CLR_S)
        #define UART_SET_RS485_CLASH_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_RS485_CLASH_INT_CLR_V,(val),UART_RS485_CLASH_INT_CLR_S)
        #define UART_SET_RS485_FRM_ERR_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_RS485_FRM_ERR_INT_CLR_V,(val),UART_RS485_FRM_ERR_INT_CLR_S)
        #define UART_SET_RS485_PARITY_ERR_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_RS485_PARITY_ERR_INT_CLR_V,(val),UART_RS485_PARITY_ERR_INT_CLR_S)
        #define UART_SET_TX_DONE_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_TX_DONE_INT_CLR_V,(val),UART_TX_DONE_INT_CLR_S)
        #define UART_SET_TX_BRK_IDLE_DONE_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_TX_BRK_IDLE_DONE_INT_CLR_V,(val),UART_TX_BRK_IDLE_DONE_INT_CLR_S)
        #define UART_SET_TX_BRK_DONE_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_TX_BRK_DONE_INT_CLR_V,(val),UART_TX_BRK_DONE_INT_CLR_S)
        #define UART_SET_GLITCH_DET_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_GLITCH_DET_INT_CLR_V,(val),UART_GLITCH_DET_INT_CLR_S)
        #define UART_SET_SW_XOFF_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_SW_XOFF_INT_CLR_V,(val),UART_SW_XOFF_INT_CLR_S)
        #define UART_SET_SW_XON_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_SW_XON_INT_CLR_V,(val),UART_SW_XON_INT_CLR_S)
        #define UART_SET_RXFIFO_TOUT_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_RXFIFO_TOUT_INT_CLR_V,(val),UART_RXFIFO_TOUT_INT_CLR_S)
        #define UART_SET_BRK_DET_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_BRK_DET_INT_CLR_V,(val),UART_BRK_DET_INT_CLR_S)
        #define UART_SET_CTS_CHG_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_CTS_CHG_INT_CLR_V,(val),UART_CTS_CHG_INT_CLR_S)
        #define UART_SET_DSR_CHG_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_DSR_CHG_INT_CLR_V,(val),UART_DSR_CHG_INT_CLR_S)
        #define UART_SET_RXFIFO_OVF_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_RXFIFO_OVF_INT_CLR_V,(val),UART_RXFIFO_OVF_INT_CLR_S)
        #define UART_SET_FRM_ERR_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_FRM_ERR_INT_CLR_V,(val),UART_FRM_ERR_INT_CLR_S)
        #define UART_SET_PARITY_ERR_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_PARITY_ERR_INT_CLR_V,(val),UART_PARITY_ERR_INT_CLR_S)
        #define UART_SET_TXFIFO_EMPTY_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_TXFIFO_EMPTY_INT_CLR_V,(val),UART_TXFIFO_EMPTY_INT_CLR_S)
        #define UART_SET_RXFIFO_FULL_INT_CLR(i,val)  SET_PERI_REG_BITS(UART_INT_CLR_REG(i) ,UART_RXFIFO_FULL_INT_CLR_V,(val),UART_RXFIFO_FULL_INT_CLR_S)



