espressif/esp-idf/components/esp32/include/soc/uart_register.h
#define UART_CLKDIV_REG(i)          (REG_UART_BASE(i) + 0x14)
    /* UART_CLKDIV_FRAG : R/W ;bitpos:[23:20] ;default: 4'b0 ; */
    /*description: The decimal part of divider*/
    #define UART_CLKDIV_FRAG  0x0000000F
    #define UART_CLKDIV_FRAG_M  ((UART_CLKDIV_FRAG_V)<<(UART_CLKDIV_FRAG_S))
    #define UART_CLKDIV_FRAG_V  0xF
    #define UART_CLKDIV_FRAG_S  20
    /* UART_CLKDIV : R/W ;bitpos:[19:0] ;default: 20'h2B6 ; */
    /*description: The interger part of divider  BAUDRATE = UART_CLK_FREQ / UART_CLKDIV*/
    #define UART_CLKDIV  0x000FFFFF
    #define UART_CLKDIV_M  ((UART_CLKDIV_V)<<(UART_CLKDIV_S))
    #define UART_CLKDIV_V  0xFFFFF
    #define UART_CLKDIV_S  0
        #define UART_GET_CLKDIV_FRAG(i)  GET_PERI_REG_BITS2(UART_CLKDIV_REG(i) , UART_CLKDIV_FRAG_V, UART_CLKDIV_FRAG_S)
        #define UART_SET_CLKDIV_FRAG(i,val)  SET_PERI_REG_BITS(UART_CLKDIV_REG(i) ,UART_CLKDIV_FRAG_V,(val),UART_CLKDIV_FRAG_S)
        #define UART_GET_CLKDIV(i)  GET_PERI_REG_BITS2(UART_CLKDIV_REG(i) , UART_CLKDIV_V, UART_CLKDIV_S)
        #define UART_SET_CLKDIV(i,val)  SET_PERI_REG_BITS(UART_CLKDIV_REG(i) ,UART_CLKDIV_V,(val),UART_CLKDIV_S)



#define UART_AUTOBAUD_REG(i)          (REG_UART_BASE(i) + 0x18)
    /* UART_GLITCH_FILT : R/W ;bitpos:[15:8] ;default: 8'h10 ; */
    /*description: ignore the glitch when pulse cnt is lower then this value*/
    #define UART_GLITCH_FILT  0x000000FF
    #define UART_GLITCH_FILT_M  ((UART_GLITCH_FILT_V)<<(UART_GLITCH_FILT_S))
    #define UART_GLITCH_FILT_V  0xFF
    #define UART_GLITCH_FILT_S  8
    /* UART_AUTOBAUD_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
    /*description: Set this bit to enable baudrate detect*/
    #define UART_AUTOBAUD_EN  (BIT(0))
    #define UART_AUTOBAUD_EN_M  (BIT(0))
    #define UART_AUTOBAUD_EN_V  0x1
    #define UART_AUTOBAUD_EN_S  0
        #define UART_GET_GLITCH_FILT(i)  GET_PERI_REG_BITS2(UART_AUTOBAUD_REG(i) , UART_GLITCH_FILT_V, UART_GLITCH_FILT_S)
        #define UART_SET_GLITCH_FILT(i,val)  SET_PERI_REG_BITS(UART_AUTOBAUD_REG(i) ,UART_GLITCH_FILT_V,(val),UART_GLITCH_FILT_S)
        #define UART_GET_AUTOBAUD_EN(i)  GET_PERI_REG_BITS2(UART_AUTOBAUD_REG(i) , UART_AUTOBAUD_EN_V, UART_AUTOBAUD_EN_S)
        #define UART_SET_AUTOBAUD_EN(i,val)  SET_PERI_REG_BITS(UART_AUTOBAUD_REG(i) ,UART_AUTOBAUD_EN_V,(val),UART_AUTOBAUD_EN_S)



#define UART_STATUS_REG(i)          (REG_UART_BASE(i) + 0x1C)
    /* UART_TXD : RO ;bitpos:[31] ;default: 8'h0 ; */
    /*description: The level of the internal uart txd value*/
    #define UART_TXD  (BIT(31))
    #define UART_TXD_M  (BIT(31))
    #define UART_TXD_V  0x1
    #define UART_TXD_S  31
    /* UART_RTSN : RO ;bitpos:[30] ;default: 1'b0 ; */
    /*description: The level of the internal uart rts pin*/
    #define UART_RTSN  (BIT(30))
    #define UART_RTSN_M  (BIT(30))
    #define UART_RTSN_V  0x1
    #define UART_RTSN_S  30
    /* UART_DTRN : RO ;bitpos:[29] ;default: 1'b0 ; */
    /*description: The level of the internaluart dtr pin*/
    #define UART_DTRN  (BIT(29))
    #define UART_DTRN_M  (BIT(29))
    #define UART_DTRN_V  0x1
    #define UART_DTRN_S  29
    /* UART_ST_UTX_OUT : RO ;bitpos:[27:24] ;default: 4'b0 ; */
    /*description: The state for transmitting data. 4'd0:TX_IDLE*/
    #define UART_ST_UTX_OUT  0x0000000F
    #define UART_ST_UTX_OUT_M  ((UART_ST_UTX_OUT_V)<<(UART_ST_UTX_OUT_S))
    #define UART_ST_UTX_OUT_V  0xF
    #define UART_ST_UTX_OUT_S  24
    /* UART_TXFIFO_CNT : RO ;bitpos:[23:16] ;default: 8'b0 ; */
    /*description: Number of data in UART TX fifo*/
    #define UART_TXFIFO_CNT  0x000000FF
    #define UART_TXFIFO_CNT_M  ((UART_TXFIFO_CNT_V)<<(UART_TXFIFO_CNT_S))
    #define UART_TXFIFO_CNT_V  0xFF
    #define UART_TXFIFO_CNT_S  16
    /* UART_RXD : RO ;bitpos:[15] ;default: 1'b0 ; */
    /*description: The level of the internal uart rxd value*/
    #define UART_RXD  (BIT(15))
    #define UART_RXD_M  (BIT(15))
    #define UART_RXD_V  0x1
    #define UART_RXD_S  15
    /* UART_CTSN : RO ;bitpos:[14] ;default: 1'b0 ; */
    /*description: The level of the internal uart cts value*/
    #define UART_CTSN  (BIT(14))
    #define UART_CTSN_M  (BIT(14))
    #define UART_CTSN_V  0x1
    #define UART_CTSN_S  14
    /* UART_DSRN : RO ;bitpos:[13] ;default: 1'b0 ; */
    /*description: The level of the internal uart dsr value*/
    #define UART_DSRN  (BIT(13))
    #define UART_DSRN_M  (BIT(13))
    #define UART_DSRN_V  0x1
    #define UART_DSRN_S  13
    /* UART_ST_URX_OUT : RO ;bitpos:[11:8] ;default: 4'b0 ; */
    /*description: The state for receiving data. 4‘d0: RX_IDLE*/
    #define UART_ST_URX_OUT  0x0000000F
    #define UART_ST_URX_OUT_M  ((UART_ST_URX_OUT_V)<<(UART_ST_URX_OUT_S))
    #define UART_ST_URX_OUT_V  0xF
    #define UART_ST_URX_OUT_S  8
    /* UART_RXFIFO_CNT : RO ;bitpos:[7:0] ;default: 8'b0 ; */
    /*description: Number of data in UART RX fifo*/
    #define UART_RXFIFO_CNT  0x000000FF
    #define UART_RXFIFO_CNT_M  ((UART_RXFIFO_CNT_V)<<(UART_RXFIFO_CNT_S))
    #define UART_RXFIFO_CNT_V  0xFF
    #define UART_RXFIFO_CNT_S  0
        #define UART_GET_TXD(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_TXD_V, UART_TXD_S)
        #define UART_GET_RTSN(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_RTSN_V, UART_RTSN_S)
        #define UART_GET_DTRN(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_DTRN_V, UART_DTRN_S)
        #define UART_GET_ST_UTX_OUT(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_ST_UTX_OUT_V, UART_ST_UTX_OUT_S)
        #define UART_GET_TXFIFO_CNT(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_TXFIFO_CNT_V, UART_TXFIFO_CNT_S)
        #define UART_GET_RXD(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_RXD_V, UART_RXD_S)
        #define UART_GET_CTSN(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_CTSN_V, UART_CTSN_S)
        #define UART_GET_DSRN(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_DSRN_V, UART_DSRN_S)
        #define UART_GET_ST_URX_OUT(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_ST_URX_OUT_V, UART_ST_URX_OUT_S)
        #define UART_GET_RXFIFO_CNT(i)  GET_PERI_REG_BITS2(UART_STATUS_REG(i) , UART_RXFIFO_CNT_V, UART_RXFIFO_CNT_S)



#define UART_CONF0_REG(i)          (REG_UART_BASE(i) + 0x20)
    /* UART_TICK_REF_ALWAYS_ON : R/W ;bitpos:[27] ;default: 1'b1 ; */
    /*description: 1：use apb clock：use referrence clock*/
    #define UART_TICK_REF_ALWAYS_ON  (BIT(27))
    #define UART_TICK_REF_ALWAYS_ON_M  (BIT(27))
    #define UART_TICK_REF_ALWAYS_ON_V  0x1
    #define UART_TICK_REF_ALWAYS_ON_S  27
    /* UART_ERR_WR_MASK : R/W ;bitpos:[26] ;default: 1'b0 ; */
    /*description: 1：rx stop storing data int rxfifo when data is error 0：if received data is wrong*/
    #define UART_ERR_WR_MASK  (BIT(26))
    #define UART_ERR_WR_MASK_M  (BIT(26))
    #define UART_ERR_WR_MASK_V  0x1
    #define UART_ERR_WR_MASK_S  26
    /* UART_CLK_EN : R/W ;bitpos:[25] ;default: 1'h0 ; */
    /*description: 1：force clock on for registers：support clock only when write registers*/
    #define UART_CLK_EN  (BIT(25))
    #define UART_CLK_EN_M  (BIT(25))
    #define UART_CLK_EN_V  0x1
    #define UART_CLK_EN_S  25
    /* UART_DTR_INV : R/W ;bitpos:[24] ;default: 1'h0 ; */
    /*description: Set this bit to inverse uart dtr level*/
    #define UART_DTR_INV  (BIT(24))
    #define UART_DTR_INV_M  (BIT(24))
    #define UART_DTR_INV_V  0x1
    #define UART_DTR_INV_S  24
    /* UART_RTS_INV : R/W ;bitpos:[23] ;default: 1'h0 ; */
    /*description: Set this bit to inverse uart rts level*/
    #define UART_RTS_INV  (BIT(23))
    #define UART_RTS_INV_M  (BIT(23))
    #define UART_RTS_INV_V  0x1
    #define UART_RTS_INV_S  23
    /* UART_TXD_INV : R/W ;bitpos:[22] ;default: 1'h0 ; */
    /*description: Set this bit to inverse uart txd level*/
    #define UART_TXD_INV  (BIT(22))
    #define UART_TXD_INV_M  (BIT(22))
    #define UART_TXD_INV_V  0x1
    #define UART_TXD_INV_S  22
    /* UART_DSR_INV : R/W ;bitpos:[21] ;default: 1'h0 ; */
    /*description: Set this bit to inverse uart dsr level*/
    #define UART_DSR_INV  (BIT(21))
    #define UART_DSR_INV_M  (BIT(21))
    #define UART_DSR_INV_V  0x1
    #define UART_DSR_INV_S  21
    /* UART_CTS_INV : R/W ;bitpos:[20] ;default: 1'h0 ; */
    /*description: Set this bit to inverse uart cts level*/
    #define UART_CTS_INV  (BIT(20))
    #define UART_CTS_INV_M  (BIT(20))
    #define UART_CTS_INV_V  0x1
    #define UART_CTS_INV_S  20
    /* UART_RXD_INV : R/W ;bitpos:[19] ;default: 1'h0 ; */
    /*description: Set this bit to inverse uart rxd level*/
    #define UART_RXD_INV  (BIT(19))
    #define UART_RXD_INV_M  (BIT(19))
    #define UART_RXD_INV_V  0x1
    #define UART_RXD_INV_S  19
    /* UART_TXFIFO_RST : R/W ;bitpos:[18] ;default: 1'h0 ; */
    /*description: Set this bit to reset uart tx fifo*/
    #define UART_TXFIFO_RST  (BIT(18))
    #define UART_TXFIFO_RST_M  (BIT(18))
    #define UART_TXFIFO_RST_V  0x1
    #define UART_TXFIFO_RST_S  18
    /* UART_RXFIFO_RST : R/W ;bitpos:[17] ;default: 1'h0 ; */
    /*description: Set this bit to reset uart rx fifo*/
    #define UART_RXFIFO_RST  (BIT(17))
    #define UART_RXFIFO_RST_M  (BIT(17))
    #define UART_RXFIFO_RST_V  0x1
    #define UART_RXFIFO_RST_S  17
    /* UART_IRDA_EN : R/W ;bitpos:[16] ;default: 1'h0 ; */
    /*description: Set this bit to enable irda protocol*/
    #define UART_IRDA_EN  (BIT(16))
    #define UART_IRDA_EN_M  (BIT(16))
    #define UART_IRDA_EN_V  0x1
    #define UART_IRDA_EN_S  16
    /* UART_TX_FLOW_EN : R/W ;bitpos:[15] ;default: 1'b0 ; */
    /*description: Set this bit to enable tx flow control*/
    #define UART_TX_FLOW_EN  (BIT(15))
    #define UART_TX_FLOW_EN_M  (BIT(15))
    #define UART_TX_FLOW_EN_V  0x1
    #define UART_TX_FLOW_EN_S  15
    /* UART_LOOPBACK : R/W ;bitpos:[14] ;default: 1'b0 ; */
    /*description: Set this bit to enable uart loopback test mode*/
    #define UART_LOOPBACK  (BIT(14))
    #define UART_LOOPBACK_M  (BIT(14))
    #define UART_LOOPBACK_V  0x1
    #define UART_LOOPBACK_S  14
    /* UART_IRDA_RX_INV : R/W ;bitpos:[13] ;default: 1'b0 ; */
    /*description: Set this bit to inverse irda rx level*/
    #define UART_IRDA_RX_INV  (BIT(13))
    #define UART_IRDA_RX_INV_M  (BIT(13))
    #define UART_IRDA_RX_INV_V  0x1
    #define UART_IRDA_RX_INV_S  13
    /* UART_IRDA_TX_INV : R/W ;bitpos:[12] ;default: 1'b0 ; */
    /*description: Set this bit to inverse irda tx level*/
    #define UART_IRDA_TX_INV  (BIT(12))
    #define UART_IRDA_TX_INV_M  (BIT(12))
    #define UART_IRDA_TX_INV_V  0x1
    #define UART_IRDA_TX_INV_S  12
    /* UART_IRDA_WCTL : R/W ;bitpos:[11] ;default: 1'b0 ; */
    /*description: 1：the tx 11th bit is the same to the 10th bit 0：set tx 11th bit to 0*/
    #define UART_IRDA_WCTL  (BIT(11))
    #define UART_IRDA_WCTL_M  (BIT(11))
    #define UART_IRDA_WCTL_V  0x1
    #define UART_IRDA_WCTL_S  11
    /* UART_IRDA_TX_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */
    /*description: Set this bit to enable irda to send data*/
    #define UART_IRDA_TX_EN  (BIT(10))
    #define UART_IRDA_TX_EN_M  (BIT(10))
    #define UART_IRDA_TX_EN_V  0x1
    #define UART_IRDA_TX_EN_S  10
    /* UART_IRDA_DPLX : R/W ;bitpos:[9] ;default: 1'b0 ; */
    /*description: Set this bit to enable irda duplex mode*/
    #define UART_IRDA_DPLX  (BIT(9))
    #define UART_IRDA_DPLX_M  (BIT(9))
    #define UART_IRDA_DPLX_V  0x1
    #define UART_IRDA_DPLX_S  9
    /* UART_TXD_BRK : R/W ;bitpos:[8] ;default: 1'b0 ; */
    /*description: Set this bit to enbale tx send 0*/
    #define UART_TXD_BRK  (BIT(8))
    #define UART_TXD_BRK_M  (BIT(8))
    #define UART_TXD_BRK_V  0x1
    #define UART_TXD_BRK_S  8
    /* UART_SW_DTR : R/W ;bitpos:[7] ;default: 1'b0 ; */
    /*description: sw dtr*/
    #define UART_SW_DTR  (BIT(7))
    #define UART_SW_DTR_M  (BIT(7))
    #define UART_SW_DTR_V  0x1
    #define UART_SW_DTR_S  7
    /* UART_SW_RTS : R/W ;bitpos:[6] ;default: 1'b0 ; */
    /*description: sw rts*/
    #define UART_SW_RTS  (BIT(6))
    #define UART_SW_RTS_M  (BIT(6))
    #define UART_SW_RTS_V  0x1
    #define UART_SW_RTS_S  6
    /* UART_STOP_BIT_NUM : R/W ;bitpos:[5:4] ;default: 2'd1 ; */
    /*description: Set stop bit: 1:1bit  2:1.5bits  3:2bits*/
    #define UART_STOP_BIT_NUM  0x00000003
    #define UART_STOP_BIT_NUM_M  ((UART_STOP_BIT_NUM_V)<<(UART_STOP_BIT_NUM_S))
    #define UART_STOP_BIT_NUM_V  0x3
    #define UART_STOP_BIT_NUM_S  4
    /* UART_BIT_NUM : R/W ;bitpos:[3:2] ;default: 2'd3 ; */
    /*description: Set bit num:  0:5bits 1:6bits 2:7bits 3:8bits*/
    #define UART_BIT_NUM  0x00000003
    #define UART_BIT_NUM_M  ((UART_BIT_NUM_V)<<(UART_BIT_NUM_S))
    #define UART_BIT_NUM_V  0x3
    #define UART_BIT_NUM_S  2
    /* UART_PARITY_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
    /*description: Set this bit to enable uart parity check*/
    #define UART_PARITY_EN  (BIT(1))
    #define UART_PARITY_EN_M  (BIT(1))
    #define UART_PARITY_EN_V  0x1
    #define UART_PARITY_EN_S  1
    /* UART_PARITY : R/W ;bitpos:[0] ;default: 1'b0 ; */
    /*description: Set parity check:  0:even 1:odd*/
    #define UART_PARITY  (BIT(0))
    #define UART_PARITY_M  (BIT(0))
    #define UART_PARITY_V  0x1
    #define UART_PARITY_S  0
        #define UART_GET_TICK_REF_ALWAYS_ON(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_TICK_REF_ALWAYS_ON_V, UART_TICK_REF_ALWAYS_ON_S)
        #define UART_SET_TICK_REF_ALWAYS_ON(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_TICK_REF_ALWAYS_ON_V,(val),UART_TICK_REF_ALWAYS_ON_S)
        #define UART_GET_ERR_WR_MASK(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_ERR_WR_MASK_V, UART_ERR_WR_MASK_S)
        #define UART_SET_ERR_WR_MASK(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_ERR_WR_MASK_V,(val),UART_ERR_WR_MASK_S)
        #define UART_GET_REG_CLK_EN(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_CLK_EN_V, UART_CLK_EN_S)
        #define UART_SET_REG_CLK_EN(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_CLK_EN_V,(val),UART_CLK_EN_S)
        #define UART_GET_DTR_INV(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_DTR_INV_V, UART_DTR_INV_S)
        #define UART_SET_DTR_INV(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_DTR_INV_V,(val),UART_DTR_INV_S)
        #define UART_GET_RTS_INV(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_RTS_INV_V, UART_RTS_INV_S)
        #define UART_SET_RTS_INV(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_RTS_INV_V,(val),UART_RTS_INV_S)
        #define UART_GET_TXD_INV(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_TXD_INV_V, UART_TXD_INV_S)
        #define UART_SET_TXD_INV(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_TXD_INV_V,(val),UART_TXD_INV_S)
        #define UART_GET_DSR_INV(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_DSR_INV_V, UART_DSR_INV_S)
        #define UART_SET_DSR_INV(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_DSR_INV_V,(val),UART_DSR_INV_S)
        #define UART_GET_CTS_INV(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_CTS_INV_V, UART_CTS_INV_S)
        #define UART_SET_CTS_INV(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_CTS_INV_V,(val),UART_CTS_INV_S)
        #define UART_GET_RXD_INV(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_RXD_INV_V, UART_RXD_INV_S)
        #define UART_SET_RXD_INV(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_RXD_INV_V,(val),UART_RXD_INV_S)
        #define UART_GET_TXFIFO_RST(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_TXFIFO_RST_V, UART_TXFIFO_RST_S)
        #define UART_SET_TXFIFO_RST(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_TXFIFO_RST_V,(val),UART_TXFIFO_RST_S)
        #define UART_GET_RXFIFO_RST(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_RXFIFO_RST_V, UART_RXFIFO_RST_S)
        #define UART_SET_RXFIFO_RST(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_RXFIFO_RST_V,(val),UART_RXFIFO_RST_S)
        #define UART_GET_IRDA_EN(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_IRDA_EN_V, UART_IRDA_EN_S)
        #define UART_SET_IRDA_EN(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_IRDA_EN_V,(val),UART_IRDA_EN_S)
        #define UART_GET_TX_FLOW_EN(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_TX_FLOW_EN_V, UART_TX_FLOW_EN_S)
        #define UART_SET_TX_FLOW_EN(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_TX_FLOW_EN_V,(val),UART_TX_FLOW_EN_S)
        #define UART_GET_LOOPBACK(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_LOOPBACK_V, UART_LOOPBACK_S)
        #define UART_SET_LOOPBACK(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_LOOPBACK_V,(val),UART_LOOPBACK_S)
        #define UART_GET_IRDA_RX_INV(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_IRDA_RX_INV_V, UART_IRDA_RX_INV_S)
        #define UART_SET_IRDA_RX_INV(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_IRDA_RX_INV_V,(val),UART_IRDA_RX_INV_S)
        #define UART_GET_IRDA_TX_INV(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_IRDA_TX_INV_V, UART_IRDA_TX_INV_S)
        #define UART_SET_IRDA_TX_INV(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_IRDA_TX_INV_V,(val),UART_IRDA_TX_INV_S)
        #define UART_GET_IRDA_WCTL(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_IRDA_WCTL_V, UART_IRDA_WCTL_S)
        #define UART_SET_IRDA_WCTL(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_IRDA_WCTL_V,(val),UART_IRDA_WCTL_S)
        #define UART_GET_IRDA_TX_EN(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_IRDA_TX_EN_V, UART_IRDA_TX_EN_S)
        #define UART_SET_IRDA_TX_EN(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_IRDA_TX_EN_V,(val),UART_IRDA_TX_EN_S)
        #define UART_GET_IRDA_DPLX(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_IRDA_DPLX_V, UART_IRDA_DPLX_S)
        #define UART_SET_IRDA_DPLX(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_IRDA_DPLX_V,(val),UART_IRDA_DPLX_S)
        #define UART_GET_TXD_BRK(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_TXD_BRK_V, UART_TXD_BRK_S)
        #define UART_SET_TXD_BRK(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_TXD_BRK_V,(val),UART_TXD_BRK_S)
        #define UART_GET_SW_DTR(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_SW_DTR_V, UART_SW_DTR_S)
        #define UART_SET_SW_DTR(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_SW_DTR_V,(val),UART_SW_DTR_S)
        #define UART_GET_SW_RTS(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_SW_RTS_V, UART_SW_RTS_S)
        #define UART_SET_SW_RTS(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_SW_RTS_V,(val),UART_SW_RTS_S)
        #define UART_GET_STOP_BIT_NUM(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_STOP_BIT_NUM_V, UART_STOP_BIT_NUM_S)
        #define UART_SET_STOP_BIT_NUM(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_STOP_BIT_NUM_V,(val),UART_STOP_BIT_NUM_S)
        #define UART_GET_BIT_NUM(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_BIT_NUM_V, UART_BIT_NUM_S)
        #define UART_SET_BIT_NUM(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_BIT_NUM_V,(val),UART_BIT_NUM_S)
        #define UART_GET_PARITY_EN(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_PARITY_EN_V, UART_PARITY_EN_S)
        #define UART_SET_PARITY_EN(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_PARITY_EN_V,(val),UART_PARITY_EN_S)
        #define UART_GET_PARITY(i)  GET_PERI_REG_BITS2(UART_CONF0_REG(i) , UART_PARITY_V, UART_PARITY_S)
        #define UART_SET_PARITY(i,val)  SET_PERI_REG_BITS(UART_CONF0_REG(i) ,UART_PARITY_V,(val),UART_PARITY_S)



#define UART_CONF1_REG(i)          (REG_UART_BASE(i) + 0x24)
    /* UART_RX_TOUT_EN : R/W ;bitpos:[31] ;default: 1'b0 ; */
    /*description: Set this bit to enable rx time-out function*/
    #define UART_RX_TOUT_EN  (BIT(31))
    #define UART_RX_TOUT_EN_M  (BIT(31))
    #define UART_RX_TOUT_EN_V  0x1
    #define UART_RX_TOUT_EN_S  31
    /* UART_RX_TOUT_THRHD : R/W ;bitpos:[30:24] ;default: 7'b0 ; */
    /*description: Config bits for rx time-out threshold*/
    #define UART_RX_TOUT_THRHD  0x0000007F
    #define UART_RX_TOUT_THRHD_M  ((UART_RX_TOUT_THRHD_V)<<(UART_RX_TOUT_THRHD_S))
    #define UART_RX_TOUT_THRHD_V  0x7F
    #define UART_RX_TOUT_THRHD_S  24
    /* UART_RX_FLOW_EN : R/W ;bitpos:[23] ;default: 1'b0 ; */
    /*description: Set this bit to enable rx hardware flow control*/
    #define UART_RX_FLOW_EN  (BIT(23))
    #define UART_RX_FLOW_EN_M  (BIT(23))
    #define UART_RX_FLOW_EN_V  0x1
    #define UART_RX_FLOW_EN_S  23
    /* UART_RX_FLOW_THRHD : R/W ;bitpos:[22:16] ;default: 7'h0 ; */
    /*description: The config bits for rx flow control threshold*/
    #define UART_RX_FLOW_THRHD  0x0000007F
    #define UART_RX_FLOW_THRHD_M  ((UART_RX_FLOW_THRHD_V)<<(UART_RX_FLOW_THRHD_S))
    #define UART_RX_FLOW_THRHD_V  0x7F
    #define UART_RX_FLOW_THRHD_S  16
    /* UART_TXFIFO_EMPTY_THRHD : R/W ;bitpos:[14:8] ;default: 7'h60 ; */
    /*description: The config bits for tx fifo empty threshold*/
    #define UART_TXFIFO_EMPTY_THRHD  0x0000007F
    #define UART_TXFIFO_EMPTY_THRHD_M  ((UART_TXFIFO_EMPTY_THRHD_V)<<(UART_TXFIFO_EMPTY_THRHD_S))
    #define UART_TXFIFO_EMPTY_THRHD_V  0x7F
    #define UART_TXFIFO_EMPTY_THRHD_S  8
    /* UART_RXFIFO_FULL_THRHD : R/W ;bitpos:[6:0] ;default: 7'h60 ; */
    /*description: The config bits for rx fifo full threshold*/
    #define UART_RXFIFO_FULL_THRHD  0x0000007F
    #define UART_RXFIFO_FULL_THRHD_M  ((UART_RXFIFO_FULL_THRHD_V)<<(UART_RXFIFO_FULL_THRHD_S))
    #define UART_RXFIFO_FULL_THRHD_V  0x7F
    #define UART_RXFIFO_FULL_THRHD_S  0
        #define UART_GET_RX_TOUT_EN(i)  GET_PERI_REG_BITS2(UART_CONF1_REG(i) , UART_RX_TOUT_EN_V, UART_RX_TOUT_EN_S)
        #define UART_SET_RX_TOUT_EN(i,val)  SET_PERI_REG_BITS(UART_CONF1_REG(i) ,UART_RX_TOUT_EN_V,(val),UART_RX_TOUT_EN_S)
        #define UART_GET_RX_TOUT_THRHD(i)  GET_PERI_REG_BITS2(UART_CONF1_REG(i) , UART_RX_TOUT_THRHD_V, UART_RX_TOUT_THRHD_S)
        #define UART_SET_RX_TOUT_THRHD(i,val)  SET_PERI_REG_BITS(UART_CONF1_REG(i) ,UART_RX_TOUT_THRHD_V,(val),UART_RX_TOUT_THRHD_S)
        #define UART_GET_RX_FLOW_EN(i)  GET_PERI_REG_BITS2(UART_CONF1_REG(i) , UART_RX_FLOW_EN_V, UART_RX_FLOW_EN_S)
        #define UART_SET_RX_FLOW_EN(i,val)  SET_PERI_REG_BITS(UART_CONF1_REG(i) ,UART_RX_FLOW_EN_V,(val),UART_RX_FLOW_EN_S)
        #define UART_GET_RX_FLOW_THRHD(i)  GET_PERI_REG_BITS2(UART_CONF1_REG(i) , UART_RX_FLOW_THRHD_V, UART_RX_FLOW_THRHD_S)
        #define UART_SET_RX_FLOW_THRHD(i,val)  SET_PERI_REG_BITS(UART_CONF1_REG(i) ,UART_RX_FLOW_THRHD_V,(val),UART_RX_FLOW_THRHD_S)
        #define UART_GET_TXFIFO_EMPTY_THRHD(i)  GET_PERI_REG_BITS2(UART_CONF1_REG(i) , UART_TXFIFO_EMPTY_THRHD_V, UART_TXFIFO_EMPTY_THRHD_S)
        #define UART_SET_TXFIFO_EMPTY_THRHD(i,val)  SET_PERI_REG_BITS(UART_CONF1_REG(i) ,UART_TXFIFO_EMPTY_THRHD_V,(val),UART_TXFIFO_EMPTY_THRHD_S)
        #define UART_GET_RXFIFO_FULL_THRHD(i)  GET_PERI_REG_BITS2(UART_CONF1_REG(i) , UART_RXFIFO_FULL_THRHD_V, UART_RXFIFO_FULL_THRHD_S)
        #define UART_SET_RXFIFO_FULL_THRHD(i,val)  SET_PERI_REG_BITS(UART_CONF1_REG(i) ,UART_RXFIFO_FULL_THRHD_V,(val),UART_RXFIFO_FULL_THRHD_S)



#define UART_LOWPULSE_REG(i)          (REG_UART_BASE(i) + 0x28)
    /* UART_LOWPULSE_MIN_CNT : RO ;bitpos:[19:0] ;default: 20'hFFFFF ; */
    /*description: used in baudrate detect*/
    #define UART_LOWPULSE_MIN_CNT  0x000FFFFF
    #define UART_LOWPULSE_MIN_CNT_M  ((UART_LOWPULSE_MIN_CNT_V)<<(UART_LOWPULSE_MIN_CNT_S))
    #define UART_LOWPULSE_MIN_CNT_V  0xFFFFF
    #define UART_LOWPULSE_MIN_CNT_S  0
        #define UART_GET_LOWPULSE_MIN_CNT(i)  GET_PERI_REG_BITS2(UART_LOWPULSE_REG(i) , UART_LOWPULSE_MIN_CNT_V, UART_LOWPULSE_MIN_CNT_S)



#define UART_HIGHPULSE_REG(i)          (REG_UART_BASE(i) + 0x2C)
    /* UART_HIGHPULSE_MIN_CNT : RO ;bitpos:[19:0] ;default: 20'hFFFFF ; */
    /*description: used in baudrate detect*/
    #define UART_HIGHPULSE_MIN_CNT  0x000FFFFF
    #define UART_HIGHPULSE_MIN_CNT_M  ((UART_HIGHPULSE_MIN_CNT_V)<<(UART_HIGHPULSE_MIN_CNT_S))
    #define UART_HIGHPULSE_MIN_CNT_V  0xFFFFF
    #define UART_HIGHPULSE_MIN_CNT_S  0
        #define UART_GET_HIGHPULSE_MIN_CNT(i)  GET_PERI_REG_BITS2(UART_HIGHPULSE_REG(i) , UART_HIGHPULSE_MIN_CNT_V, UART_HIGHPULSE_MIN_CNT_S)



