espressif/esp-idf/components/esp32/include/soc/uart_register.h
#define UART_RXD_CNT_REG(i)          (REG_UART_BASE(i) + 0x30)
    /* UART_RXD_EDGE_CNT : RO ;bitpos:[9:0] ;default: 10'h0 ; */
    /*description: used in baudrate detect*/
    #define UART_RXD_EDGE_CNT  0x000003FF
    #define UART_RXD_EDGE_CNT_M  ((UART_RXD_EDGE_CNT_V)<<(UART_RXD_EDGE_CNT_S))
    #define UART_RXD_EDGE_CNT_V  0x3FF
    #define UART_RXD_EDGE_CNT_S  0
        #define UART_GET_RXD_EDGE_CNT(i)  GET_PERI_REG_BITS2(UART_RXD_CNT_REG(i) , UART_RXD_EDGE_CNT_V, UART_RXD_EDGE_CNT_S)



#define UART_FLOW_CONF_REG(i)          (REG_UART_BASE(i) + 0x34)
    /* UART_SEND_XOFF : R/W ;bitpos:[5] ;default: 1'b0 ; */
    /*description: */
    #define UART_SEND_XOFF  (BIT(5))
    #define UART_SEND_XOFF_M  (BIT(5))
    #define UART_SEND_XOFF_V  0x1
    #define UART_SEND_XOFF_S  5
    /* UART_SEND_XON : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: */
    #define UART_SEND_XON  (BIT(4))
    #define UART_SEND_XON_M  (BIT(4))
    #define UART_SEND_XON_V  0x1
    #define UART_SEND_XON_S  4
    /* UART_FORCE_XOFF : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: Set this bit to set ctsn*/
    #define UART_FORCE_XOFF  (BIT(3))
    #define UART_FORCE_XOFF_M  (BIT(3))
    #define UART_FORCE_XOFF_V  0x1
    #define UART_FORCE_XOFF_S  3
    /* UART_FORCE_XON : R/W ;bitpos:[2] ;default: 1'b0 ; */
    /*description: Set this bit to clear ctsn*/
    #define UART_FORCE_XON  (BIT(2))
    #define UART_FORCE_XON_M  (BIT(2))
    #define UART_FORCE_XON_V  0x1
    #define UART_FORCE_XON_S  2
    /* UART_XONOFF_DEL : R/W ;bitpos:[1] ;default: 1'b0 ; */
    /*description: Set this bit to remove flow control char from rx data*/
    #define UART_XONOFF_DEL  (BIT(1))
    #define UART_XONOFF_DEL_M  (BIT(1))
    #define UART_XONOFF_DEL_V  0x1
    #define UART_XONOFF_DEL_S  1
    /* UART_SW_FLOW_CON_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
    /*description: Set this bit to enable sw flow control*/
    #define UART_SW_FLOW_CON_EN  (BIT(0))
    #define UART_SW_FLOW_CON_EN_M  (BIT(0))
    #define UART_SW_FLOW_CON_EN_V  0x1
    #define UART_SW_FLOW_CON_EN_S  0
        #define UART_GET_SEND_XOFF(i)  GET_PERI_REG_BITS2(UART_FLOW_CONF_REG(i) , UART_SEND_XOFF_V, UART_SEND_XOFF_S)
        #define UART_SET_SEND_XOFF(i,val)  SET_PERI_REG_BITS(UART_FLOW_CONF_REG(i) ,UART_SEND_XOFF_V,(val),UART_SEND_XOFF_S)
        #define UART_GET_SEND_XON(i)  GET_PERI_REG_BITS2(UART_FLOW_CONF_REG(i) , UART_SEND_XON_V, UART_SEND_XON_S)
        #define UART_SET_SEND_XON(i,val)  SET_PERI_REG_BITS(UART_FLOW_CONF_REG(i) ,UART_SEND_XON_V,(val),UART_SEND_XON_S)
        #define UART_GET_FORCE_XOFF(i)  GET_PERI_REG_BITS2(UART_FLOW_CONF_REG(i) , UART_FORCE_XOFF_V, UART_FORCE_XOFF_S)
        #define UART_SET_FORCE_XOFF(i,val)  SET_PERI_REG_BITS(UART_FLOW_CONF_REG(i) ,UART_FORCE_XOFF_V,(val),UART_FORCE_XOFF_S)
        #define UART_GET_FORCE_XON(i)  GET_PERI_REG_BITS2(UART_FLOW_CONF_REG(i) , UART_FORCE_XON_V, UART_FORCE_XON_S)
        #define UART_SET_FORCE_XON(i,val)  SET_PERI_REG_BITS(UART_FLOW_CONF_REG(i) ,UART_FORCE_XON_V,(val),UART_FORCE_XON_S)
        #define UART_GET_XONOFF_DEL(i)  GET_PERI_REG_BITS2(UART_FLOW_CONF_REG(i) , UART_XONOFF_DEL_V, UART_XONOFF_DEL_S)
        #define UART_SET_XONOFF_DEL(i,val)  SET_PERI_REG_BITS(UART_FLOW_CONF_REG(i) ,UART_XONOFF_DEL_V,(val),UART_XONOFF_DEL_S)
        #define UART_GET_SW_FLOW_CON_EN(i)  GET_PERI_REG_BITS2(UART_FLOW_CONF_REG(i) , UART_SW_FLOW_CON_EN_V, UART_SW_FLOW_CON_EN_S)
        #define UART_SET_SW_FLOW_CON_EN(i,val)  SET_PERI_REG_BITS(UART_FLOW_CONF_REG(i) ,UART_SW_FLOW_CON_EN_V,(val),UART_SW_FLOW_CON_EN_S)



#define UART_SLEEP_CONF_REG(i)          (REG_UART_BASE(i) + 0x38)
    /* UART_ACTIVE_THRESHOLD : R/W ;bitpos:[9:0] ;default: 10'hf0 ; */
    /*description: when the num of rx level change is more than this value*/
    #define UART_ACTIVE_THRESHOLD  0x000003FF
    #define UART_ACTIVE_THRESHOLD_M  ((UART_ACTIVE_THRESHOLD_V)<<(UART_ACTIVE_THRESHOLD_S))
    #define UART_ACTIVE_THRESHOLD_V  0x3FF
    #define UART_ACTIVE_THRESHOLD_S  0
        #define UART_GET_ACTIVE_THRESHOLD(i)  GET_PERI_REG_BITS2(UART_SLEEP_CONF_REG(i) , UART_ACTIVE_THRESHOLD_V, UART_ACTIVE_THRESHOLD_S)
        #define UART_SET_ACTIVE_THRESHOLD(i,val)  SET_PERI_REG_BITS(UART_SLEEP_CONF_REG(i) ,UART_ACTIVE_THRESHOLD_V,(val),UART_ACTIVE_THRESHOLD_S)



#define UART_SWFC_CONF_REG(i)          (REG_UART_BASE(i) + 0x3C)
    /* UART_XOFF_CHAR : R/W ;bitpos:[31:24] ;default: 8'h13 ; */
    /*description: xoff char*/
    #define UART_XOFF_CHAR  0x000000FF
    #define UART_XOFF_CHAR_M  ((UART_XOFF_CHAR_V)<<(UART_XOFF_CHAR_S))
    #define UART_XOFF_CHAR_V  0xFF
    #define UART_XOFF_CHAR_S  24
    /* UART_XON_CHAR : R/W ;bitpos:[23:16] ;default: 8'h11 ; */
    /*description: xon char*/
    #define UART_XON_CHAR  0x000000FF
    #define UART_XON_CHAR_M  ((UART_XON_CHAR_V)<<(UART_XON_CHAR_S))
    #define UART_XON_CHAR_V  0xFF
    #define UART_XON_CHAR_S  16
    /* UART_XOFF_THRESHOLD : R/W ;bitpos:[15:8] ;default: 8'he0 ; */
    /*description: rx stop receiving data when rxfifo_cnt is more than this value*/
    #define UART_XOFF_THRESHOLD  0x000000FF
    #define UART_XOFF_THRESHOLD_M  ((UART_XOFF_THRESHOLD_V)<<(UART_XOFF_THRESHOLD_S))
    #define UART_XOFF_THRESHOLD_V  0xFF
    #define UART_XOFF_THRESHOLD_S  8
    /* UART_XON_THRESHOLD : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
    /*description: rx continue receiving data when rxfifo cnt is less then this value*/
    #define UART_XON_THRESHOLD  0x000000FF
    #define UART_XON_THRESHOLD_M  ((UART_XON_THRESHOLD_V)<<(UART_XON_THRESHOLD_S))
    #define UART_XON_THRESHOLD_V  0xFF
    #define UART_XON_THRESHOLD_S  0
        #define UART_GET_XOFF_CH(i)  GET_PERI_REG_BITS2(UART_SWFC_CONF_REG(i) , UART_XOFF_CHAR_V, UART_XOFF_CHAR_S)
        #define UART_SET_XOFF_CH(i,val)  SET_PERI_REG_BITS(UART_SWFC_CONF_REG(i) ,UART_XOFF_CHAR_V,(val),UART_XOFF_CHAR_S)
        #define UART_GET_XON_CH(i)  GET_PERI_REG_BITS2(UART_SWFC_CONF_REG(i) , UART_XON_CHAR_V, UART_XON_CHAR_S)
        #define UART_SET_XON_CH(i,val)  SET_PERI_REG_BITS(UART_SWFC_CONF_REG(i) ,UART_XON_CHAR_V,(val),UART_XON_CHAR_S)
        #define UART_GET_XOFF_THRESHOLD(i)  GET_PERI_REG_BITS2(UART_SWFC_CONF_REG(i) , UART_XOFF_THRESHOLD_V, UART_XOFF_THRESHOLD_S)
        #define UART_SET_XOFF_THRESHOLD(i,val)  SET_PERI_REG_BITS(UART_SWFC_CONF_REG(i) ,UART_XOFF_THRESHOLD_V,(val),UART_XOFF_THRESHOLD_S)
        #define UART_GET_XON_THRESHOLD(i)  GET_PERI_REG_BITS2(UART_SWFC_CONF_REG(i) , UART_XON_THRESHOLD_V, UART_XON_THRESHOLD_S)
        #define UART_SET_XON_THRESHOLD(i,val)  SET_PERI_REG_BITS(UART_SWFC_CONF_REG(i) ,UART_XON_THRESHOLD_V,(val),UART_XON_THRESHOLD_S)



#define UART_IDLE_CONF_REG(i)          (REG_UART_BASE(i) + 0x40)
    /* UART_TX_BRK_NUM : R/W ;bitpos:[27:20] ;default: 8'ha ; */
    /*description: brk number config*/
    #define UART_TX_BRK_NUM  0x000000FF
    #define UART_TX_BRK_NUM_M  ((UART_TX_BRK_NUM_V)<<(UART_TX_BRK_NUM_S))
    #define UART_TX_BRK_NUM_V  0xFF
    #define UART_TX_BRK_NUM_S  20
    /* UART_TX_IDLE_NUM : R/W ;bitpos:[19:10] ;default: 10'h100 ; */
    /*description: idle number config*/
    #define UART_TX_IDLE_NUM  0x000003FF
    #define UART_TX_IDLE_NUM_M  ((UART_TX_IDLE_NUM_V)<<(UART_TX_IDLE_NUM_S))
    #define UART_TX_IDLE_NUM_V  0x3FF
    #define UART_TX_IDLE_NUM_S  10
    /* UART_RX_IDLE_THRHD : R/W ;bitpos:[9:0] ;default: 10'h100 ; */
    /*description: rx idle number config*/
    #define UART_RX_IDLE_THRHD  0x000003FF
    #define UART_RX_IDLE_THRHD_M  ((UART_RX_IDLE_THRHD_V)<<(UART_RX_IDLE_THRHD_S))
    #define UART_RX_IDLE_THRHD_V  0x3FF
    #define UART_RX_IDLE_THRHD_S  0
        #define UART_GET_TX_BRK_NUM(i)  GET_PERI_REG_BITS2(UART_IDLE_CONF_REG(i) , UART_TX_BRK_NUM_V, UART_TX_BRK_NUM_S)
        #define UART_SET_TX_BRK_NUM(i,val)  SET_PERI_REG_BITS(UART_IDLE_CONF_REG(i) ,UART_TX_BRK_NUM_V,(val),UART_TX_BRK_NUM_S)
        #define UART_GET_TX_IDLE_NUM(i)  GET_PERI_REG_BITS2(UART_IDLE_CONF_REG(i) , UART_TX_IDLE_NUM_V, UART_TX_IDLE_NUM_S)
        #define UART_SET_TX_IDLE_NUM(i,val)  SET_PERI_REG_BITS(UART_IDLE_CONF_REG(i) ,UART_TX_IDLE_NUM_V,(val),UART_TX_IDLE_NUM_S)
        #define UART_GET_RX_IDLE_THRHD(i)  GET_PERI_REG_BITS2(UART_IDLE_CONF_REG(i) , UART_RX_IDLE_THRHD_V, UART_RX_IDLE_THRHD_S)
        #define UART_SET_RX_IDLE_THRHD(i,val)  SET_PERI_REG_BITS(UART_IDLE_CONF_REG(i) ,UART_RX_IDLE_THRHD_V,(val),UART_RX_IDLE_THRHD_S)



#define UART_RS485_CONF_REG(i)          (REG_UART_BASE(i) + 0x44)
    /* UART_RS485_TX_DLY_NUM : R/W ;bitpos:[9:6] ;default: 4'b0 ; */
    /*description: config this reg to delay tx signal*/
    #define UART_RS485_TX_DLY_NUM  0x0000000F
    #define UART_RS485_TX_DLY_NUM_M  ((UART_RS485_TX_DLY_NUM_V)<<(UART_RS485_TX_DLY_NUM_S))
    #define UART_RS485_TX_DLY_NUM_V  0xF
    #define UART_RS485_TX_DLY_NUM_S  6
    /* UART_RS485_RX_DLY_NUM : R/W ;bitpos:[5] ;default: 1'b0 ; */
    /*description: config this reg to delay rx signal*/
    #define UART_RS485_RX_DLY_NUM  (BIT(5))
    #define UART_RS485_RX_DLY_NUM_M  (BIT(5))
    #define UART_RS485_RX_DLY_NUM_V  0x1
    #define UART_RS485_RX_DLY_NUM_S  5
    /* UART_RS485RXBY_TX_EN : R/W ;bitpos:[4] ;default: 1'b0 ; */
    /*description: set this bit to enable tx when rx is busy*/
    #define UART_RS485RXBY_TX_EN  (BIT(4))
    #define UART_RS485RXBY_TX_EN_M  (BIT(4))
    #define UART_RS485RXBY_TX_EN_V  0x1
    #define UART_RS485RXBY_TX_EN_S  4
    /* UART_RS485TX_RX_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */
    /*description: set this bit to enable rx receiving when tx is sending*/
    #define UART_RS485TX_RX_EN  (BIT(3))
    #define UART_RS485TX_RX_EN_M  (BIT(3))
    #define UART_RS485TX_RX_EN_V  0x1
    #define UART_RS485TX_RX_EN_S  3
    /* UART_DL1_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */
    /*description: set this bit to add 1 bit stop bit(after data)*/
    #define UART_DL1_EN  (BIT(2))
    #define UART_DL1_EN_M  (BIT(2))
    #define UART_DL1_EN_V  0x1
    #define UART_DL1_EN_S  2
    /* UART_DL0_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
    /*description: set this bit to add 1 bit stop bit(before data)*/
    #define UART_DL0_EN  (BIT(1))
    #define UART_DL0_EN_M  (BIT(1))
    #define UART_DL0_EN_V  0x1
    #define UART_DL0_EN_S  1
    /* UART_RS485_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
    /*description: set this bit to enable rs485 protocol*/
    #define UART_RS485_EN  (BIT(0))
    #define UART_RS485_EN_M  (BIT(0))
    #define UART_RS485_EN_V  0x1
    #define UART_RS485_EN_S  0
        #define UART_GET_RS485_TX_DLY_NUM(i)  GET_PERI_REG_BITS2(UART_RS485_CONF_REG(i) , UART_RS485_TX_DLY_NUM_V, UART_RS485_TX_DLY_NUM_S)
        #define UART_SET_RS485_TX_DLY_NUM(i,val)  SET_PERI_REG_BITS(UART_RS485_CONF_REG(i) ,UART_RS485_TX_DLY_NUM_V,(val),UART_RS485_TX_DLY_NUM_S)
        #define UART_GET_RS485_RX_DLY_NUM(i)  GET_PERI_REG_BITS2(UART_RS485_CONF_REG(i) , UART_RS485_RX_DLY_NUM_V, UART_RS485_RX_DLY_NUM_S)
        #define UART_SET_RS485_RX_DLY_NUM(i,val)  SET_PERI_REG_BITS(UART_RS485_CONF_REG(i) ,UART_RS485_RX_DLY_NUM_V,(val),UART_RS485_RX_DLY_NUM_S)
        #define UART_GET_RS485RXBY_TX_EN(i)  GET_PERI_REG_BITS2(UART_RS485_CONF_REG(i) , UART_RS485RXBY_TX_EN_V, UART_RS485RXBY_TX_EN_S)
        #define UART_SET_RS485RXBY_TX_EN(i,val)  SET_PERI_REG_BITS(UART_RS485_CONF_REG(i) ,UART_RS485RXBY_TX_EN_V,(val),UART_RS485RXBY_TX_EN_S)
        #define UART_GET_RS485TX_RX_EN(i)  GET_PERI_REG_BITS2(UART_RS485_CONF_REG(i) , UART_RS485TX_RX_EN_V, UART_RS485TX_RX_EN_S)
        #define UART_SET_RS485TX_RX_EN(i,val)  SET_PERI_REG_BITS(UART_RS485_CONF_REG(i) ,UART_RS485TX_RX_EN_V,(val),UART_RS485TX_RX_EN_S)
        #define UART_GET_DL1_EN(i)  GET_PERI_REG_BITS2(UART_RS485_CONF_REG(i) , UART_DL1_EN_V, UART_DL1_EN_S)
        #define UART_SET_DL1_EN(i,val)  SET_PERI_REG_BITS(UART_RS485_CONF_REG(i) ,UART_DL1_EN_V,(val),UART_DL1_EN_S)
        #define UART_GET_DL0_EN(i)  GET_PERI_REG_BITS2(UART_RS485_CONF_REG(i) , UART_DL0_EN_V, UART_DL0_EN_S)
        #define UART_SET_DL0_EN(i,val)  SET_PERI_REG_BITS(UART_RS485_CONF_REG(i) ,UART_DL0_EN_V,(val),UART_DL0_EN_S)
        #define UART_GET_RS485_EN(i)  GET_PERI_REG_BITS2(UART_RS485_CONF_REG(i) , UART_RS485_EN_V, UART_RS485_EN_S)
        #define UART_SET_RS485_EN(i,val)  SET_PERI_REG_BITS(UART_RS485_CONF_REG(i) ,UART_RS485_EN_V,(val),UART_RS485_EN_S)



