espressif/esp-idf/components/esp32/include/soc/uart_register.h
#define UART_AT_CMD_PRECNT_REG(i)          (REG_UART_BASE(i) + 0x48)
    /* UART_PRE_IDLE_NUM : R/W ;bitpos:[23:0] ;default: 24'h186a00 ; */
    /*description: config the idle time before receiving AT_CMD*/
    #define UART_PRE_IDLE_NUM  0x00FFFFFF
    #define UART_PRE_IDLE_NUM_M  ((UART_PRE_IDLE_NUM_V)<<(UART_PRE_IDLE_NUM_S))
    #define UART_PRE_IDLE_NUM_V  0xFFFFFF
    #define UART_PRE_IDLE_NUM_S  0
        #define UART_GET_PRE_IDLE_NUM(i)  GET_PERI_REG_BITS2(UART_AT_CMD_PRECNT_REG(i) , UART_PRE_IDLE_NUM_V, UART_PRE_IDLE_NUM_S)
        #define UART_SET_PRE_IDLE_NUM(i,val)  SET_PERI_REG_BITS(UART_AT_CMD_PRECNT_REG(i) ,UART_PRE_IDLE_NUM_V,(val),UART_PRE_IDLE_NUM_S)



#define UART_AT_CMD_POSTCNT_REG(i)          (REG_UART_BASE(i) + 0x4c)
    /* UART_POST_IDLE_NUM : R/W ;bitpos:[23:0] ;default: 24'h186a00 ; */
    /*description: config the idle time after receiving AT_CMD*/
    #define UART_POST_IDLE_NUM  0x00FFFFFF
    #define UART_POST_IDLE_NUM_M  ((UART_POST_IDLE_NUM_V)<<(UART_POST_IDLE_NUM_S))
    #define UART_POST_IDLE_NUM_V  0xFFFFFF
    #define UART_POST_IDLE_NUM_S  0
        #define UART_GET_POST_IDLE_NUM(i)  GET_PERI_REG_BITS2(UART_AT_CMD_POSTCNT_REG(i) , UART_POST_IDLE_NUM_V, UART_POST_IDLE_NUM_S)
        #define UART_SET_POST_IDLE_NUM(i,val)  SET_PERI_REG_BITS(UART_AT_CMD_POSTCNT_REG(i) ,UART_POST_IDLE_NUM_V,(val),UART_POST_IDLE_NUM_S)



#define UART_AT_CMD_GAPTOUT_REG(i)          (REG_UART_BASE(i) + 0x50)
    /* UART_RX_GAP_TOUT : R/W ;bitpos:[23:0] ;default: 24'h1e00 ; */
    /*description: config the time between receiving two AT_CMD*/
    #define UART_RX_GAP_TOUT  0x00FFFFFF
    #define UART_RX_GAP_TOUT_M  ((UART_RX_GAP_TOUT_V)<<(UART_RX_GAP_TOUT_S))
    #define UART_RX_GAP_TOUT_V  0xFFFFFF
    #define UART_RX_GAP_TOUT_S  0
        #define UART_GET_RX_GAP_TOUT(i)  GET_PERI_REG_BITS2(UART_AT_CMD_GAPTOUT_REG(i) , UART_RX_GAP_TOUT_V, UART_RX_GAP_TOUT_S)
        #define UART_SET_RX_GAP_TOUT(i,val)  SET_PERI_REG_BITS(UART_AT_CMD_GAPTOUT_REG(i) ,UART_RX_GAP_TOUT_V,(val),UART_RX_GAP_TOUT_S)



#define UART_AT_CMD_CHAR_REG(i)          (REG_UART_BASE(i) + 0x54)
    /* UART_CHAR_NUM : R/W ;bitpos:[15:8] ;default: 8'd3 ; */
    /*description: config the continous num of AT_CMD*/
    #define UART_CHAR_NUM  0x000000FF
    #define UART_CHAR_NUM_M  ((UART_CHAR_NUM_V)<<(UART_CHAR_NUM_S))
    #define UART_CHAR_NUM_V  0xFF
    #define UART_CHAR_NUM_S  8
    /* UART_AT_CMD_CHAR : R/W ;bitpos:[7:0] ;default: 8'h2b ; */
    /*description: config AT_CMD*/
    #define UART_AT_CMD_CHAR  0x000000FF
    #define UART_AT_CMD_CHAR_M  ((UART_AT_CMD_CHAR_V)<<(UART_AT_CMD_CHAR_S))
    #define UART_AT_CMD_CHAR_V  0xFF
    #define UART_AT_CMD_CHAR_S  0
        #define UART_GET_CHAR_NUM(i)  GET_PERI_REG_BITS2(UART_AT_CMD_CHAR_REG(i) , UART_CHAR_NUM_V, UART_CHAR_NUM_S)
        #define UART_SET_CHAR_NUM(i,val)  SET_PERI_REG_BITS(UART_AT_CMD_CHAR_REG(i) ,UART_CHAR_NUM_V,(val),UART_CHAR_NUM_S)
        #define UART_GET_AT_CMD_CHAR(i)  GET_PERI_REG_BITS2(UART_AT_CMD_CHAR_REG(i) , UART_AT_CMD_CHAR_V, UART_AT_CMD_CHAR_S)
        #define UART_SET_AT_CMD_CHAR(i,val)  SET_PERI_REG_BITS(UART_AT_CMD_CHAR_REG(i) ,UART_AT_CMD_CHAR_V,(val),UART_AT_CMD_CHAR_S)



#define UART_MEM_CONF_REG(i)          (REG_UART_BASE(i) + 0x58)
    /* UART_TX_MEM_EMPTY_THRHD : R/W ;bitpos:[30:28] ;default: 3'h0 ; */
    /*description: the most significant bits of tx fifo empty threashold*/
    #define UART_TX_MEM_EMPTY_THRHD  0x00000007
    #define UART_TX_MEM_EMPTY_THRHD_M  ((UART_TX_MEM_EMPTY_THRHD_V)<<(UART_TX_MEM_EMPTY_THRHD_S))
    #define UART_TX_MEM_EMPTY_THRHD_V  0x7
    #define UART_TX_MEM_EMPTY_THRHD_S  28
    /* UART_RX_MEM_FULL_THRHD : R/W ;bitpos:[27:25] ;default: 3'h0 ; */
    /*description: the most significant bits of rx fifo full threashold*/
    #define UART_RX_MEM_FULL_THRHD  0x00000007
    #define UART_RX_MEM_FULL_THRHD_M  ((UART_RX_MEM_FULL_THRHD_V)<<(UART_RX_MEM_FULL_THRHD_S))
    #define UART_RX_MEM_FULL_THRHD_V  0x7
    #define UART_RX_MEM_FULL_THRHD_S  25
    /* UART_XOFF_THRESHOLD_H2 : R/W ;bitpos:[24:23] ;default: 2'h0 ; */
    /*description: the most significant bits of uart xoff flow threashold*/
    #define UART_XOFF_THRESHOLD_H2  0x00000003
    #define UART_XOFF_THRESHOLD_H2_M  ((UART_XOFF_THRESHOLD_H2_V)<<(UART_XOFF_THRESHOLD_H2_S))
    #define UART_XOFF_THRESHOLD_H2_V  0x3
    #define UART_XOFF_THRESHOLD_H2_S  23
    /* UART_XON_THRESHOLD_H2 : R/W ;bitpos:[22:21] ;default: 2'h0 ; */
    /*description: the most significant bits of uart xon flow threshold*/
    #define UART_XON_THRESHOLD_H2  0x00000003
    #define UART_XON_THRESHOLD_H2_M  ((UART_XON_THRESHOLD_H2_V)<<(UART_XON_THRESHOLD_H2_S))
    #define UART_XON_THRESHOLD_H2_V  0x3
    #define UART_XON_THRESHOLD_H2_S  21
    /* UART_RX_TOUT_THRHD_H3 : R/W ;bitpos:[20:18] ;default: 3h0 ; */
    /*description: the most significant bits of rx timeout threshold*/
    #define UART_RX_TOUT_THRHD_H3  0x00000007
    #define UART_RX_TOUT_THRHD_H3_M  ((UART_RX_TOUT_THRHD_H3_V)<<(UART_RX_TOUT_THRHD_H3_S))
    #define UART_RX_TOUT_THRHD_H3_V  0x7
    #define UART_RX_TOUT_THRHD_H3_S  18
    /* UART_RX_FLOW_THRHD_H3 : R/W ;bitpos:[17:15] ;default: 3'h0 ; */
    /*description: the most significant bits of  rx flow control threshold*/
    #define UART_RX_FLOW_THRHD_H3  0x00000007
    #define UART_RX_FLOW_THRHD_H3_M  ((UART_RX_FLOW_THRHD_H3_V)<<(UART_RX_FLOW_THRHD_H3_S))
    #define UART_RX_FLOW_THRHD_H3_V  0x7
    #define UART_RX_FLOW_THRHD_H3_S  15
    /* UART_TX_SIZE : R/W ;bitpos:[10:7] ;default: 3'h0 ; */
    /*description: config tx_mem's size(128*reg_rx_size)*/
    #define UART_TX_SIZE  0x0000000F
    #define UART_TX_SIZE_M  ((UART_TX_SIZE_V)<<(UART_TX_SIZE_S))
    #define UART_TX_SIZE_V  0xF
    #define UART_TX_SIZE_S  7
    /* UART_RX_SIZE : R/W ;bitpos:[6:3] ;default: 3'h0 ; */
    /*description: config rx mem's size(128*reg_rx_size)*/
    #define UART_RX_SIZE  0x0000000F
    #define UART_RX_SIZE_M  ((UART_RX_SIZE_V)<<(UART_RX_SIZE_S))
    #define UART_RX_SIZE_V  0xF
    #define UART_RX_SIZE_S  3
    /* UART_MEM_PD : R/W ;bitpos:[0] ;default: 1'b0 ; */
    /*description: set this bit to pull_down mem's pd signal*/
    #define UART_MEM_PD  (BIT(0))
    #define UART_MEM_PD_M  (BIT(0))
    #define UART_MEM_PD_V  0x1
    #define UART_MEM_PD_S  0
        #define UART_GET_TX_MEM_EMPTY_THRHD(i)  GET_PERI_REG_BITS2(UART_MEM_CONF_REG(i) , UART_TX_MEM_EMPTY_THRHD_V, UART_TX_MEM_EMPTY_THRHD_S)
        #define UART_SET_TX_MEM_EMPTY_THRHD(i,val)  SET_PERI_REG_BITS(UART_MEM_CONF_REG(i) ,UART_TX_MEM_EMPTY_THRHD_V,(val),UART_TX_MEM_EMPTY_THRHD_S)
        #define UART_GET_RX_MEM_FULL_THRHD(i)  GET_PERI_REG_BITS2(UART_MEM_CONF_REG(i) , UART_RX_MEM_FULL_THRHD_V, UART_RX_MEM_FULL_THRHD_S)
        #define UART_SET_RX_MEM_FULL_THRHD(i,val)  SET_PERI_REG_BITS(UART_MEM_CONF_REG(i) ,UART_RX_MEM_FULL_THRHD_V,(val),UART_RX_MEM_FULL_THRHD_S)
        #define UART_GET_XOFF_THRESHOLD_H2(i)  GET_PERI_REG_BITS2(UART_MEM_CONF_REG(i) , UART_XOFF_THRESHOLD_H2_V, UART_XOFF_THRESHOLD_H2_S)
        #define UART_SET_XOFF_THRESHOLD_H2(i,val)  SET_PERI_REG_BITS(UART_MEM_CONF_REG(i) ,UART_XOFF_THRESHOLD_H2_V,(val),UART_XOFF_THRESHOLD_H2_S)
        #define UART_GET_XON_THRESHOLD_H2(i)  GET_PERI_REG_BITS2(UART_MEM_CONF_REG(i) , UART_XON_THRESHOLD_H2_V, UART_XON_THRESHOLD_H2_S)
        #define UART_SET_XON_THRESHOLD_H2(i,val)  SET_PERI_REG_BITS(UART_MEM_CONF_REG(i) ,UART_XON_THRESHOLD_H2_V,(val),UART_XON_THRESHOLD_H2_S)
        #define UART_GET_RX_TOUT_THRHD_H3(i)  GET_PERI_REG_BITS2(UART_MEM_CONF_REG(i) , UART_RX_TOUT_THRHD_H3_V, UART_RX_TOUT_THRHD_H3_S)
        #define UART_SET_RX_TOUT_THRHD_H3(i,val)  SET_PERI_REG_BITS(UART_MEM_CONF_REG(i) ,UART_RX_TOUT_THRHD_H3_V,(val),UART_RX_TOUT_THRHD_H3_S)
        #define UART_GET_RX_FLOW_THRHD_H3(i)  GET_PERI_REG_BITS2(UART_MEM_CONF_REG(i) , UART_RX_FLOW_THRHD_H3_V, UART_RX_FLOW_THRHD_H3_S)
        #define UART_SET_RX_FLOW_THRHD_H3(i,val)  SET_PERI_REG_BITS(UART_MEM_CONF_REG(i) ,UART_RX_FLOW_THRHD_H3_V,(val),UART_RX_FLOW_THRHD_H3_S)
        #define UART_GET_REG_TX_SIZE(i)  GET_PERI_REG_BITS2(UART_MEM_CONF_REG(i) , UART_TX_SIZE_V, UART_TX_SIZE_S)
        #define UART_SET_REG_TX_SIZE(i,val)  SET_PERI_REG_BITS(UART_MEM_CONF_REG(i) ,UART_TX_SIZE_V,(val),UART_TX_SIZE_S)
        #define UART_GET_REG_RX_SIZE(i)  GET_PERI_REG_BITS2(UART_MEM_CONF_REG(i) , UART_RX_SIZE_V, UART_RX_SIZE_S)
        #define UART_SET_REG_RX_SIZE(i,val)  SET_PERI_REG_BITS(UART_MEM_CONF_REG(i) ,UART_RX_SIZE_V,(val),UART_RX_SIZE_S)
        #define UART_GET_REG_MEM_PD(i)  GET_PERI_REG_BITS2(UART_MEM_CONF_REG(i) , UART_MEM_PD_V, UART_MEM_PD_S)
        #define UART_SET_REG_MEM_PD(i,val)  SET_PERI_REG_BITS(UART_MEM_CONF_REG(i) ,UART_MEM_PD_V,(val),UART_MEM_PD_S)



