espressif/esp-idf/components/esp32/include/soc/uart_register.h
#define UART_MEM_TX_STATUS_REG(i)          (REG_UART_BASE(i) + 0x5c)
    /* UART_TX_RADDR_CHX : RO ;bitpos:[23:13] ;default: 11'b0 ; */
    /*description: uartx tx mem's read address*/
    #define UART_TX_RADDR_CHX  0x000007FF
    #define UART_TX_RADDR_CHX_M  ((UART_TX_RADDR_CHX_V)<<(UART_TX_RADDR_CHX_S))
    #define UART_TX_RADDR_CHX_V  0x7FF
    #define UART_TX_RADDR_CHX_S  13
    /* UART_APB_TX_WADDR_CHX : RO ;bitpos:[12:2] ;default: 11'b0 ; */
    /*description: uartx tx mem's write address*/
    #define UART_APB_TX_WADDR_CHX  0x000007FF
    #define UART_APB_TX_WADDR_CHX_M  ((UART_APB_TX_WADDR_CHX_V)<<(UART_APB_TX_WADDR_CHX_S))
    #define UART_APB_TX_WADDR_CHX_V  0x7FF
    #define UART_APB_TX_WADDR_CHX_S  2
        #define UART_GET_TX_RADDR_CHX(i)  GET_PERI_REG_BITS2(UART_MEM_TX_STATUS_REG(i) , UART_TX_RADDR_CHX_V, UART_TX_RADDR_CHX_S)
        #define UART_GET_APB_TX_WADDR_CHX(i)  GET_PERI_REG_BITS2(UART_MEM_TX_STATUS_REG(i) , UART_APB_TX_WADDR_CHX_V, UART_APB_TX_WADDR_CHX_S)



#define UART_MEM_RX_STATUS_REG(i)          (REG_UART_BASE(i) + 0x60)
    /* UART_RX_WADDR_CHX : RO ;bitpos:[23:13] ;default: 11'b0 ; */
    /*description: uartx rx mem's write address*/
    #define UART_RX_WADDR_CHX  0x000007FF
    #define UART_RX_WADDR_CHX_M  ((UART_RX_WADDR_CHX_V)<<(UART_RX_WADDR_CHX_S))
    #define UART_RX_WADDR_CHX_V  0x7FF
    #define UART_RX_WADDR_CHX_S  13
    /* UART_APB_RX_RADDR_CHX : RO ;bitpos:[12:2] ;default: 11'b0 ; */
    /*description: uartx rx mem's read address*/
    #define UART_APB_RX_RADDR_CHX  0x000007FF
    #define UART_APB_RX_RADDR_CHX_M  ((UART_APB_RX_RADDR_CHX_V)<<(UART_APB_RX_RADDR_CHX_S))
    #define UART_APB_RX_RADDR_CHX_V  0x7FF
    #define UART_APB_RX_RADDR_CHX_S  2
        #define UART_GET_RX_WADDR_CHX(i)  GET_PERI_REG_BITS2(UART_MEM_RX_STATUS_REG(i) , UART_RX_WADDR_CHX_V, UART_RX_WADDR_CHX_S)
        #define UART_GET_APB_RX_RADDR_CHX(i)  GET_PERI_REG_BITS2(UART_MEM_RX_STATUS_REG(i) , UART_APB_RX_RADDR_CHX_V, UART_APB_RX_RADDR_CHX_S)



#define UART_DATE_REG(i)          (REG_UART_BASE(i) + 0x78)
    /* UART_DATE : R/W ;bitpos:[31:0] ;default: 32'h15122500 ; */
    /*description: */
    #define UART_DATE  0xFFFFFFFF
    #define UART_DATE_M  ((UART_DATE_V)<<(UART_DATE_S))
    #define UART_DATE_V  0xFFFFFFFF
    #define UART_DATE_S  0
        #define UART_GET_DATE(i)  GET_PERI_REG_BITS2(UART_DATE_REG(i) , UART_DATE_V, UART_DATE_S)
        #define UART_SET_DATE(i,val)  SET_PERI_REG_BITS(UART_DATE_REG(i) ,UART_DATE_V,(val),UART_DATE_S)



#define UART_ID_REG(i)          (REG_UART_BASE(i) + 0x7C)
    /* UART_ID : R/W ;bitpos:[31:0] ;default: 32'h0500 ; */
    /*description: */
    #define UART_ID  0xFFFFFFFF
    #define UART_ID_M  ((UART_ID_V)<<(UART_ID_S))
    #define UART_ID_V  0xFFFFFFFF
    #define UART_ID_S  0
        #define UART_GET_ID(i)  GET_PERI_REG_BITS2(UART_ID_REG(i) , UART_ID_V, UART_ID_S)
        #define UART_SET_ID(i,val)  SET_PERI_REG_BITS(UART_ID_REG(i) ,UART_ID_V,(val),UART_ID_S)






#endif /* _SOC_UART_REG_H_ */


